[
	{
		"id": 1,
		"logo": "/public/img/sponsors/abc-financial.png",
		"datePosted": "2017-14-7",
		"posTitle": "DevOps Engineer",
		"location": "Sherwood, AR or Remote",
		"posType": "Full Time",
		"posDesc": "<h6>Roles and Responsiblities:</h6><ul><li>Automation. Automation. Automation. Develop and deploy software that will help drive improvements in the DevOps pipeline.</li><li>Continue to bridge gap between development and operations with a strong bias towards Infrastructure as Code.</li><li>Embrace feedback from our engineering teams to improve their SDLC with automation.</li><li>Debug, research, or investigate issues in development and production.</li><li>Use Jira for tracking work items through sprints.</li><li>Periodic on-call duties to provide application support, incident management, and troubleshooting.</li></ul><h6>Requirements:</h6><ul><li>3 or more years of systems administration experience.</li><li>Strong Linux administration skills (RedHat, Fedora, CentOS, etc.).</li><li>Knowledgeable in modern configuration management tools (Chef, Ansible, Fabric, etc.).</li><li> Knowledge of network protocols.</li><li>Knowledge of build tools (Gradle or Maven).</li><li>Track record of successful practical problem solving, excellent written and interpersonal communication, and documentation skills.</li><li>Ability to prioritize tasks and work independently.</li></ul><h6>What will set you apart:</h6><ul><li>Deep experience with Chef.</li><li>Large distributed system monitoring experience.</li><li>Having been a part of a successful DevOps team.</li><li>Understanding of Linux containers (LXC) and similar technologies (Docker, Kubernetes, etc.).</li><li>BS/MS in Engineering (or equivalent).</li></ul>",
		"appLink": "mailto:Stephanie.Goodwin@abcfinancial.com",
		"orgName": "ABC Financial",
		"orgDesc": "<p>ABC is the industry leader in providing software and billing services for the health club and fitness industry. ABC has a proven track record of growth and stability. We serve over 8,500 clubs with over 15 million members. From tracking member attendance to processing billions of recurring subscription payments for health clubs, ABC works hard to create raving fans through our software solutions. We develop our software solutions in an agile, dynamic environment, and we constantly strive to use the best technologies to achieve our purpose. ABC is looking for highly motivated and talented engineers who are passionate about engineering velocity and automation. ABC is currently on the ground floor of implementing a DevOps pipeline utilizing Chef. We develop in an agile, dynamic environment always striving to use the best technologies. We are leveraging Jenkins, GitHub, Docker, and Chef. This pipeline will help the development of Java services and many different UI applications. If you would like a job where you automate all the things and create happy engineers, ABC Financial would be a great place for you!</p>"
	},
	{
		"id": 2,
		"logo": "/public/img/sponsors/abc-financial.png",
		"datePosted": "2017-14-7",
		"posTitle": "Business Analyst",
		"location": "Sherwood, AR",
		"posType": "Full Time",
		"posDesc": "The Business Analyst provides the critical link between the business and technology sides of the organization by effectively discerning and analyzing the true needs of business users; developing and modeling detailed steps that most effectively and efficiently solve business problems; and communicating these solutions to technology staff. The Business Analyst works with business resources within the company (end users, managers, QA/Testing, Developers, and executives) as well as business interest external to the company (customers, suppliers and partners). The Business Analyst works throughout the continuum of detail from the extremely general to the extremely specific and has a critical mind to identify opportunities when none may seemingly exist. As a client centric organization that changes quickly, documentation is of all processes are within the scope of an agile/ad-hoc development environment.<h6>EDUCATION and/or EXPERIENCE:</h6><ul><li>Bachelor’s degree in business or related field from an accredited college or university.</li><li>5+ years experience in Systems Analysis.</li><li>5+ years reviewing the systems of various types such as:  Accounting, Finance, Marketing, Sales, Inventory, Scheduling, POS, EFT, and Credit Card Processing. Experience with Website design or 3+ years ABC experience.</li><li>Experience working in an agile development environment and using industry standard software tools to capture and manage user stories.</li><li>Experience performing usability studies, ROI, NPV, and feasibility analysis.</li><li>Excellent writing skills, experience with teaching, facilitating, and leading seminars and training sessions.</li><li>Experience developing automated testing strategies and scenarios.</li></ul>",
		"appLink": "mailto:Stephanie.Goodwin@abcfinancial.com",
		"orgName": "ABC Financial",
		"orgDesc": "<p>ABC is the industry leader in providing software and billing services for the health club and fitness industry. ABC has a proven track record of growth and stability. We serve over 8,500 clubs with over 15 million members. From tracking member attendance to processing billions of recurring subscription payments for health clubs, ABC works hard to create raving fans through our software solutions. We develop our software solutions in an agile, dynamic environment, and we constantly strive to use the best technologies to achieve our purpose. ABC is looking for highly motivated and talented engineers who are passionate about engineering velocity and automation. ABC is currently on the ground floor of implementing a DevOps pipeline utilizing Chef. We develop in an agile, dynamic environment always striving to use the best technologies. We are leveraging Jenkins, GitHub, Docker, and Chef. This pipeline will help the development of Java services and many different UI applications. If you would like a job where you automate all the things and create happy engineers, ABC Financial would be a great place for you!</p>"
	},
  {
		"id": 3,
		"logo": "/public/img/sponsors/euronet-software-logo.png",
		"datePosted": "2017-20-7",
		"posTitle": "Software Architect",
		"location": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "<h6>This job might be for you if you:</h6><ul><li>Want to be responsible for the design, development and support of a mission critical processing platform and other enterprise applications.</li><li>Have the ability to own and drive tasks/assignments while collaborating with peers and other technology teams.</li><li>Enjoy building knowledge of financial products and concepts.</li></ul><h6>What you will be doing:</h6><ul><li>Create new products and modifications of existing product throughout the entire project life cycle. This will require working with product managers to assess requirements and develop design documents that will allow a programming team to create solutions for those requirements.</li><li>Coordination of design reviews with fellow architects and other stakeholders, explanations of the design to the programming team, and coordination of coding, testing, and final product deployment will be managed by the successful candidate.</li></ul><h6>What you will need for this position:</h6><ul><li>3-5 years of experience in Software Development, Design, and System Integration.</li><li>BS in Computer Science, or 5+ years of programming/designing experience.</li><li>SOA architectural design skills.</li><li>Java / Java Server Faces (JSF) framework.</li><li>WebSphere Application Server experience.</li><li>Programming experience with SQL.</li><li>Problem solving skills.</li><li>HTML development.</li><li>XML.</li><li>WSDL.</li><li>Teamwork and excellent communication skills.</li><li>Ability to work independently without significant supervision.</li></ul><h6>Preferred Skills:</h6><ul><li>Knowledge of IBM iSeries.</li><li>RPG programming experience with RPG ILE and RPG Free.</li><li>Rational Software experience.</li><li>Experience with Financial Transaction processing systems.</li></ul><h6>What's in it for you:</h6><p>We offer a generous benefit package including Medical, Dental, Vision, Life Insurance, Flexible Spending Account, Health Savings Account, 401K, Employee Stock Purchase Plan, Education Reimbursement as well as an exciting, evolving work environment!</p><h6>Search Firm Disclosure:</h6><p>Please be aware Euronet Worldwide, Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. This includes any phone calls or emails. All resumes submitted by search firms to any employee at Euronet Worldwide, Inc. via-email, the Internet (including social media) or in any form and/or method for this specific position in the absence of a written recruiting agreement executed by both you and/or your firm and Euronet Worldwide Inc. will be deemed the sole property of Euronet Worldwide Inc. and no fee will be paid in the event the candidate is hired by Euronet Worldwide Inc.</p><p>We are an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, or national origin, age, disability status, genetic information, protected veteran status, or any other characteristic protected by law.</p>",
		"appLink": "http://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ608666713&rpid=32875&webapp=1",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "<p>Euronet provides secure electronic financial transaction solutions and has received notable industry accolades for its financial success and business innovations. With three primary business segments and local operations in 55 countries, Euronet employs approximately 5,600 professionals. At Euronet, we understand that behind the success of our Company are our employees. We are proud of our diverse team, which works from 59 different global offices. Euronet serves clients in approximately 165 countries, providing our employees with unparalleled opportunities with which to build their careers and skills. We offer a competitive salary and benefits package, as well as the opportunity for professional — and personal — growth. A career at Euronet offers you access to some of the most exciting and dynamic challenges of your lifetime.</p>"
	},
	{
		"id": 4,
		"logo": "/public/img/sponsors/euronet-software-logo.png",
		"datePosted": "2017-20-7",
		"posTitle": "Entry-Level Programmer Analyst",
		"location": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "<h6>This job might be for you if you:</h6><ul><li>Want to be responsible for the design, development and support of a mission critical processing platform and other enterprise applications.</li><li>Have the ability to own and drive tasks/assignments while collaborating with peers and other technology teams.</li><li>Enjoy building knowledge of financial products and concepts.</li><li>Want to work alongside the hardware developers on a number of projects using C++ and Java.</li></ul><h6>What you will be doing:</h6><ul><li>Assist with issue tracking and resolution.</li><li>Assist in the physical arrangement and connection of equipment as necessary.</li><li>Perform testing and documentation of results.</li><li>Participate in new product development, quality assurance and design review.</li><li>Serve as 2nd and 3rd level support for production issues.</li><li>Research assignments, document all changes and enhancements and comply with the programming standards and other policies and procedures.</li><li>Modify existing programs to resolve problems or add functionality.</li></ul><h6>What you will need for this position:</h6><ul><li>Bachelor’s degree in Computer Science or related field or equivalent work experience.</li><li>1-2 years of experience in Software Development.</li><li>Programming experience with the following: Java and/or C++, SQL, JavaScript, PHP.</li><li>Strong analytical and problem-solving skills.</li><li>Excellent communication skills.</li><li>Ability to multi-task and manage priorities in a team environment.</li><li>Ability to work independently without significant supervision.</li></ul><h6>Added skills we value:</h6><ul><li>Banking industry experience.</li><li>Knowledge of banking and/or financial systems.</li><li>Programming Experience with any of the following: Python, PHP, JavaScript.</li></ul><h6>What's in it for you:</h6><p>Euronet Worldwide Inc. offers a generous benefit package including Health, 401(k), Employee Stock Purchase Plan, tuition reimbursement and life insurance. We are a progressive, growth-oriented company looking for talented individuals to help us reach our goals.</p><h6>Search Firm Disclosure:</h6><p>Please be aware Euronet Worldwide, Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. This includes any phone calls or emails. All resumes submitted by search firms to any employee at Euronet Worldwide, Inc. via-email, the Internet (including social media) or in any form and/or method for this specific position in the absence of a written recruiting agreement executed by both you and/or your firm and Euronet Worldwide Inc. will be deemed the sole property of Euronet Worldwide Inc. and no fee will be paid in the event the candidate is hired by Euronet Worldwide Inc.</p><p>We are an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity, or national origin, age, disability status, genetic information, protected veteran status, or any other characteristic protected by law.</p>",
		"appLink": "http://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ901555613&rpid=31791",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "<p>Euronet provides secure electronic financial transaction solutions and has received notable industry accolades for its financial success and business innovations. With three primary business segments and local operations in 55 countries, Euronet employs approximately 5,600 professionals. At Euronet, we understand that behind the success of our Company are our employees. We are proud of our diverse team, which works from 59 different global offices. Euronet serves clients in approximately 165 countries, providing our employees with unparalleled opportunities with which to build their careers and skills. We offer a competitive salary and benefits package, as well as the opportunity for professional — and personal — growth. A career at Euronet offers you access to some of the most exciting and dynamic challenges of your lifetime.</p>"
	},
	{
		"id": 5,
		"logo": "/public/img/sponsors/euronet-software-logo.png",
		"datePosted": "2017-20-7",
		"posTitle": "Security Analyst",
		"location": "Little Rock, AR",
		"posType": "Part Time",
		"posDesc": "<h6>This job might be for you if you:</h6><p>Are an experienced Information Security Analyst and interested in being based in Little Rock, Arkansas with a reporting line back to the EFT Segment Security Officer in Budapest Hungry. The position is the part of the Euronet Worldwide EFT Information Security Team. The Team is responsible for maintaining the logical security infrastructure of the company which is used so as to secure the electronic transactions, services and solutions provided to internal users and external customers. The position will work the tools and technologies used by the company for securing the infrastructure, as well as, gain deep knowledge on the information security standards in order for the company to be able to conduct its business in a secure manner.</p><h6>What you will be doing:</h6><ul><li>Manage and control Intrusion Detection and Intrusion Prevention (IDS/IPS) on both a host and on a network level.</li><li>Manage and control the security information and event management system of the company.</li><li>Manage and control the anti malware infrastructure of the company.</li><li>Manage and control the ATM security infrastructure of the company.</li><li>Suggest mitigation strategies and solutions for the findings of the vulnerability management program of the company.</li><li>Play a major role in the designing secure solutions for the network and system infrastructure.</li><li>Create rules and alerts so as to identify, mitigate and/or be notified about 0-day exploits and threats.</li><li>Work with external consultants on independent security audits.</li></ul><h6>What you will need for this position:</h6><ul><li>University Degree in Computer Information Systems, Computer Science or a related field is a must.</li><li>At least 6 months (internship).</li><li>1 year of IT security experience in the use of tools and techniques for the host-based or network-based intrusion and detection or prevention, virus detection, developing of incident response programs.</li></ul><h6>We value:</h6><ul><li>Experience in a Microsoft based environment.</li><li>CEH, MCSE, CCNA, Network+ Security+, SSCP or relevant certifications.</li><li>iSeries AS/400 experience.</li><li>Flexibility and reliability.</li><li>Strong analytical and critical thinking.</li><li>Strong planning and time management skills.</li><li>Ability to work within/with geographically and culturally diversified teams.</li><li>Ability to work under pressure.</li><li>Dedication and commitment.</li><li>Ability to take initiative.</li><li>Strong communication skills.</li><li>Willing to learn.</li><li>Team player.</li></ul><h6>What's in it for you:</h6><p>Euronet Worldwide Inc. offers a generous benefit package including Health, 401(k), Employee Stock Purchase Plan, tuition reimbursement, and life insurance. We are a progressive, growth-oriented company looking for talented individuals to help us reach our goals.</p>",
		"appLink": "http://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ548940127&rpid=26174&webapp=1",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "<p>Euronet provides secure electronic financial transaction solutions and has received notable industry accolades for its financial success and business innovations. With three primary business segments and local operations in 55 countries, Euronet employs approximately 5,600 professionals. At Euronet, we understand that behind the success of our Company are our employees. We are proud of our diverse team, which works from 59 different global offices. Euronet serves clients in approximately 165 countries, providing our employees with unparalleled opportunities with which to build their careers and skills. We offer a competitive salary and benefits package, as well as the opportunity for professional — and personal — growth. A career at Euronet offers you access to some of the most exciting and dynamic challenges of your lifetime.</p>"
	},
	{
		"id": 6,
		"logo": "/public/img/sponsors/inuvo_logo.png",
		"datePosted": "2017-23-8",
		"posTitle": "Java Engineer",
		"location": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "<h6>Java Software Engineer</h6><p>Inuvo is looking to hire a talented engineer to join a growing software development team. Engineers in this role will play an integral part in the design and development of a native ad delivery platform. Ideal candidates will be creative in design, diligent in problem solving, dedicated to the quality of their work, skilled in one or more required technologies, and overall versatile.</p>​<h6>Primary Responsibilities:</h6><ul><li>Contribute to the design, implementation, and deployment of high performance and highly scalable services and web applications.</li><li>Lead the development effort for our media product components, including the Real Time Bidding (RTB) architecture, the ad serving infrastructure, and all components related to a media campaign life cycle.</li><li>Implement business-critical internal web applications, specifically for campaign management, targeting, and optimization.</li></ul><h6>Qualifications:</h6><ul><li>BS/MS in Computer Science or related technical field.</li><li>10+ years of software development experience, building and shipping Java web based applications.</li><li>Excellent core Java coding skills (Java guru) and solid OOP design skills.</li><li>Good knowledge of database concepts, and experience with related data access technologies (SQL & Stored Procedures, NoSQL based: Cassandra, Redis).</li><li>Comfortable performing many roles: architect, main developer, QA.</li><li>Significant development experience in a Linux environment preferred.</li><li>Experience with large-scale data processing (Hadoop and M/R) a big plus.</li><li>Experience with RTB and the OpenRTB protocol, a big plus.</li><li>Working knowledge of Internet protocols, networks, Python, Perl and/or Shell, Web services, SOAP, REST, a plus.</li><li>Basic experience with the DSP stack (demand/supply chain, campaign management, KPIs) a plus.</li></ul>",
		"appLink": "http://inuvo.com/careers/",
		"orgName": "Inuvo",
		"orgDesc": "<p>Inuvo delivers superior results for advertisers and publishers by connecting the right consumers with the right advertisers at the right time.Our unique technology and partnerships enable a sophisticated mix of search and display ads that are highly viewable, relevant, and calibrated to enhance the user experience.</p>"
	},
	{
		"id": 7,
		"logo": "/public/img/sponsors/fo-logo.png",
		"datePosted": "2017-14-9",
		"posTitle": "IOS Mobile Developer",
		"location": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "<p>First Orion is seeking a talented engineer to join a leading mobile software vendor in the User Experience Architecture Group. This business group is responsible for providing all the mobile software on users’ handsets and the back-end parts of the SOA-based data solutions and services, enabling the mobile application to communicate with the various carrier network services, backend data providers and workflows. The engineer will design, develop and maintain Android-based solutions, work directly with OEMs on the latest software and firmware and ensure high level of user satisfaction by creating a great user experience with the mobile application. </p><h6>Job Responsibilities:</h6> <ul><li>Develop innovative and user-friendly user interface and help enhance user experience for the PrivacyStar suite of applications</li><li>Help identify, fix or improve current solutions using cutting edge mobile technologies and Android OS facilities and frameworks</li><li>Work with the rest of the development team to ensure the best end-to-end user experience</li><li>Help define the future of PrivacyStar applications by building innovative approaches to business problems on mobile devices</li><li>Work with the backend development team to ensure the most efficient use of the backend APIs as well as help shape the new lightweight APIs and Web Servicto work with the Android UX</li><li>Participate in Continuous Integration, Code Coverage and App Store release process, as well as other parts of the Application Development Lifecycle to ensuhigh quality and agility of the software development process</li></ul><h6>Required Skills:</h6> <ul><li>Strong working knowledge of C++, Java, C# or Objective-C. If you know some other OOP language, that’s a plus</li><li>Software development and debugging skills</li><li>Knowledge of basic networking principles behind World Wide Web. Most of our products are web-connected</li><li>Basic to advanced knowledge of HTML and Web Page development. We rely on these technologies a lot</li></ul><h6>Nice To Have Skills:</h6> <ul><li>Knowledge of developing with HTML5/CSS/JavaScript</li><li>Working knowledge of app development on Android or IOS platform</li><li>Ability to create engaging user interfaces and knowledge of usability principles</li><li>Experience developing user-facing applications</li><li>Experience in graphics manipulation or design</li><li>Strong interpersonal and communication skills</li></ul><h6>If You Are A Match…</h6> <p>We’ll make sure to give you plenty of opportunities to learn new technologies and acquire new skills. You’ll be able to get a first-hand experience of what other customers think about your product—no filters applied. You’ll get to learn about mobile telephony and work directly with OEMs making the mobile handsets, carriers providing the service and other partners we have—all working together to deliver a solution to the consumers. You’ll see real-time statistics and know the impact your work is making on the company and its future. You’ll work with very experienced and capable leaders.</p><h6>Company Benefits:</h6> <p>At First Orion we offer a competitive salary, full benefit package including matching 401(k) and an open paid time off policy. Our work environment is energetic, focused, fun, and collaborative. We’ve created a special culture where trust and transparency are key and employees are empowered to make their own decisions. Our people are passionate about what we do and have an indomitable spirit to get things done. Everyone is a part of the big picture here.</p><p>First Orion Voted Great Place to Work US with Top Rankings in every category! Check out the full spread here: <a href='http://ow.ly/a731303vHps'>http://ow.ly/a731303vHps</a></p><p>First Orion is an Affirmative Action and Equal Opportunity Employer. Apply today!</p>",
		"appLink": "http://grnh.se/pw15q31",
		"orgName": "First Orion",
		"orgDesc": "<p>First Orion is an industry-leading call protection and data provider, developing software and services to enable our customers to take complete control over their telecommunications, powered by world-class data and technology solutions. Our applications and in-network services provide call and text blocking, spam and robocall blocking, caller identification, directory assistance and complaint filing with regulatory agencies in US and abroad. With our help, customers have blocked over 200 million numbers and continue to file over 300,000 complaints monthly against offending callers directly to federal agencies. First Orion provides solutions to some of the largest mobile service process in the world and features leading brands in the communication industry including PrivacyStar and Accudata with offices in Washington, Arkansas, Texas and London, England.  </p>"
	},
	{
		"id": 8,
		"logo": "/public/img/sponsors/advanced-cable-logo.jpg",
		"datePosted": "2017-02-10",
		"posTitle": "Research and Development Physical Security",
		"location": "Little Rock, AR",
		"posType": "Contract",
		"posDesc": "<p>Contract Position for Research & Development of Security Systems, hiring immediately!! Advanced Cabling is looking for an innovator in physical security tech to research/test new products, and develop proprietary products for the company. Unlimited creative freedom, great company culture, and zero micro-managing. If you have a passion for physical security (residential & commercial), a desire and ability to make existing products better, and a vision for new ways to provide security and integrated systems management, WE WANT YOU! Email Holly at hhall@advancedcabling.com to set up an interview.</p>",
		"appLink": "https://www.indeed.com/cmp/Advanced-Cabling-Systems/jobs/Research-Development-Security-System-Contract-Position-7474c59b6deaf28d?q=research+security+systems",
		"orgName": "Advanced Cabling Systems",
		"orgDesc": "<p>Advanced Cabling Systems is one of the leading security installers in the United States, and the largest security company in Arkansas. As a leader in the industry, Advanced is constantly looking for new and innovative solutions to security issues for both commercial and residential applications.  Our team is looking for a self-driven, security technology savvy, and creative individual to lead a new products development division of Advanced.  This person would identify existing security products already on the market, install and evaluate these products in a test environment, and identify potential new uses and enhancements for these products, as well as other products used by Advanced in commercial markets.</p>"
	}
]
