
[
  {
    "Id": 1,
    "FirstName": "Jeremy",
    "LastName": "Jones",
    "Bio": "Jeremy is an award-winning designer with a successful record crafting effective solutions from concept all the way to completion. Jeremy has over thirteen years of professional design experience including: graphic design, advertising, UI/UX, development, and creative direction for Agency 100 and Inc. 500 companies. Currently Jeremy is a designer and front-end developer at Mainstream Technologies.",
    "Website": "http://www.jerdesign.net",
    "Twitter": "jerwjones",
    "Photo": "/public/img/speakers/jones-jeremy.jpg",
    "Company": "Mainstream Technologies",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom A",
        "SessionNumber": 1,
        "Topic": "Unicorns & Dinosaurs",
        "Description": "Knowing and being the \"expert\" on everything from rolling the server, to back-end development, and pixel perfecting the UI is unsustainable at best. The technologies and processes that we rely on to build and deploy software is changing at a quicker rate for any one individual to truly be an expert for long. This presentation reviews the sources of conflict and how to embrace compromise between the front-end designers and back-end developers on a software team. "
      }
    ]
  },
  {
    "Id": 2,
    "FirstName": "John",
    "LastName": "Callaway",
    "Bio": "John has been a professional developer since 1999. He has focused primarily on web technologies and has experience with everything from PHP to C# to AngularJS to SignalR. Clean code and professionalism are particularly important to him, as well as mentoring and teaching others what he has learned along the way.",
    "Website": "http://www.1north.com",
    "Twitter": "MatsuBonsai",
    "Photo": "/public/img/speakers/callaway-john.jpg",
    "Company": "",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 2,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 1,
        "Topic": "TDD: A Pragmatic Approach",
        "Description": "Unit Testing can be mysterious endeavor with a high bar for entry. It doesn't have to be that complicated. Many examples on the Internet show you how to write a Unit Test, but not how to test an entire application. We'll discuss the fundamentals of TDD, how to approach an entire application, how to separate logical layers, and how to test the boundaries."
      }
    ]
  },
  {
    "Id": 4,
    "FirstName": "Mark",
    "LastName": "Bates",
    "Bio": "Mark Bates is the founder and chief architect of the Boston, MA based consulting company, Meta42 Labs. Mark spends his days focusing on new application development and consulting for his clients. At night he writes books, raises kids, and occasionally he forms a band and \"tries to make it\". <br/><br/>Mark is the author of three books, \"Distributed Programming with Ruby\" (2009), \"Programming in CoffeeScript\" (2012), and \"Conquering the Command Line\" (2014). <br/><br/>Mark also ran the weekly Golang screencast site, [www.metacasts.tv](http://www.metacasts.tv) which was acquired by O'Reilly in 2015.",
    "Website": "http://www.markbates.com",
    "Twitter": "markbates",
    "Photo": "/public/img/speakers/bates-mark.jpg",
    "Company": "@markbates",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 4,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom B",
        "SessionNumber": 3,
        "Topic": "Butterfly in Reverse: From SOA to Monolith",
        "Description": "Service Oriented Architecture, Single Page Web Apps, JSON APIs, all of the big buzz words. I love all of them. I spend my days building these types of systems for my clients. That's why when I started working on my side project startup with a friend we chose Go, Angular, and SOA. We were going to build this application \"the right way\".<br/><br/>So why, if you go to the site now, is it a single Rails monolith with full page refreshes and almost no JavaScript? That's an excellent question, and the subject of this talk.<br/><br/>During this talk we'll look at how I started building my application \"correctly\" and ended up with the classic monolith architecture you hear people warning against. We'll talk about why Go, SOA, and Angular were all the wrong choices for this app, and why the monolith was the right answer.<br/><br/>Along the way you might learn something or two about making the correct architectual choices for your organization, at the very least you'll hear some funny stories about my pain and a few choice animated GIFs as well."
      }
    ]
  },
  {
    "Id": 5,
    "FirstName": "Paul",
    "LastName": "Gower",
    "Bio": "Paul started his career as a software developer in 2001 developing client/server enterprise solutions.  He is a great problem solver who enjoys using thorough analysis, deep consultation and the latest software development practices to help clients solve problems.  In 2014 Paul started his company, [Lunamark](http://lunamark.com), where he leverages his years of experience to help companies improve their software development team’s efficiency using techniques such as clean coding practices, code reviews, and pair programming. ",
    "Website": "http://lunamark.com",
    "Twitter": "paulmgower",
    "Photo": "/public/img/speakers/gower-paul.jpg",
    "Company": "Lunamark",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 5,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom C",
        "SessionNumber": 3,
        "Topic": "Code Review: How and When",
        "Description": "You want to improve your software skills. That’s a given. You may be a mentor or a manager who needs to improve the knowledge sharing among your software developers across different projects. Code Reviews can do just that while improving code quality in your projects. Code Review not only builds developer team spirit but also offers new ways to improve a software solution. You’ll walk away from this session with in-depth understanding of Code Review to strengthen your team."
      }
    ]
  },
  {
    "Id": 6,
    "FirstName": "Paul",
    "LastName": "Hacker",
    "Bio": "Paul Hacker has over 15 years of application architecture, design, development, and management expertise in Microsoft technologies. Paul has a depth of experience in ALM, Process Improvement, and Team Foundation Server.  Having distinguished himself as a leader in the IT industry he has been awarded the distinction of Microsoft MVP in the ALM category every year since 2006.Over the years Paul has proven his expertise in Application Lifecycle Management and has demonstrated his professionalism and commitment to the continuous process of managing the life of an application through governance, development and maintenance.",
    "Website": "http://paulhacker.net",
    "Twitter": "pjhacker",
    "Photo": "/public/img/speakers/hacker-paul.jpg",
    "Company": null,
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 6,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom A",
        "SessionNumber": 1,
        "Topic": "Getting Started with Team Foundation Server 2015 Build",
        "Description": "TFS 2015 introduces a completely new system. Wondering what this is about and why (again) belongs to something new to you? Join us to explore the next generation of TFS build system and learn more about the background, the technical implementation and the benefits (eg, Cross-Platform builds). "
      }
    ]
  },
  {
    "Id": 8,
    "FirstName": "Don",
    "LastName": "Schenck",
    "Bio": "A developer since the beginning of time, Don is currently a Director of Developer Experience at Red Hat, with a focus on Microsoft .NET on Linux. His mission is to bring .NET developers into the Linux and open source communities. Prior to Red Hat, Don was a Developer Advocate at Rackspace. He still enjoys cooking and still hates the designated hitter rule.",
    "Website": "http://redhatloves.net",
    "Twitter": "DonSchenck",
    "Photo": "/public/img/speakers/schenck-don.jpg",
    "Company": "Red Hat",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 8,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 3,
        "Topic": "I Can Run C# In Docker?",
        "Description": "Yes. Yes, you can. You can run your C# programs, including web sites, RESTful services, and anything else you can dream up, in a Docker container.<br/><br/><br/>Starting with the very basics, this session will introduce you to microservices and Docker, and then demonstrate how to build a Docker image that will run a web site written in C# in a Docker container that is running Red Hat Enterprise Linux (RHEL).<br/><br/>It's a brave new world, where Microsoft hearts Linux and Red Hat loves .NET. Come out and take advantage of the union; learn some Docker, see RHEL running .NET, and leave with resources to help you along, including a zero-cost Developer's copy of RHEL."
      },
      {
        "Id": 1052,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom C",
        "SessionNumber": 5,
        "Topic": ".NET on Linux: Zero to Hero In Minutes",
        "Description": ".NET Core 1.0 is the new .NET.<br/><br/>ASPNET Core 1.0 is the new ASP.NET.<br/><br/>.NET on Linux is the new hotness.<br/><br/>In this fast-paced session you’ll learn how to install .NET on Linux and create your first program. You’ll learn about: the different parts of .NET Core 1.0; package managers and NuGet; the new command line interface (CoreCLI); and a great editor that is not Visual Studio. By the end of this presentation, you will know how to create a C# program that runs on Linux. No smoke, no mirrors, no tricks; it just works.<br/><br/>You’ll also learn why this is important to you and your organization.<br/><br/>Finally, you’ll leave with all the tools needed to start right away, including a Developer’s Copy of Red Hat Enterprise Linux (RHEL) that you can start using on your PC or Mac today."
      }
    ]
  },
  {
    "Id": 9,
    "FirstName": "Jonathan",
    "LastName": "Fontanez",
    "Bio": "I'm a full stack developer with a need for speed! Building web applications is my passion and focusing on user experience is my goal. I have had the opportunity to work in multiple industries ranging from health care, converged infrastructure, and big data analytics. I enjoy keeping up with the latest web technologies and frameworks and building a variety of apps. I enjoy the evolution of the web and understanding how to continually improve my code as a result.<br/><br/>When I'm not developing I enjoy running, reading, and spending time with my wife and twin boys.",
    "Website": "https://www.linkedin.com/in/jonathan-fontanez-27715428",
    "Twitter": "jonfontanez",
    "Photo": "/public/img/speakers/fontanez-jonathan.jpg",
    "Company": "Pendo",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 9,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 2,
        "Topic": "Building performant web applications",
        "Description": "Building performant web applications can be challenging! Cloud services enable web applications to scale globally and frameworks like React and AngularJS2 make it easier to build maintainable large scale web applications. However, one concern never changes; building applications that quickly provide responses to user interactions and understanding when they don't. This talk dives into some of the tools provided by browser vendors, how you can optimize your code, and understanding what is happening under the hood. This talk is relevant for web developers building applications large and small regardless of your framework choices. "
      }
    ]
  },
  {
    "Id": 10,
    "FirstName": "David",
    "LastName": "Yarde",
    "Bio": "David Yarde is the co-founder of Sevenality, a Branding firm that specializes in design, and user experience with the aim of building better communities by helping build better brands. When David isn’t working on Sevenality or volunteering, he’s busy being Batman and spending time with his family and occasionally sharing tweets via @dsmy.",
    "Website": "http://davidyarde.com",
    "Twitter": "dsmy",
    "Photo": "/public/img/speakers/yarde-david.jpg",
    "Company": "Sevenality",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 10,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom A",
        "SessionNumber": 2,
        "Topic": "The Art of Working with Non-Developers",
        "Description": "No matter the platform, useful programming requirements get lost in translation from client meetings, to project managers and finally as a to-do ticket. Sucking all the joy out of the development process and reducing things down to daily sprints, with the hopes of launching on time. <br/><br/>There has to be a better way!<br/><br/>Together we’ll take a look at effective ways of getting everyone on the same page, minimizing scope creep and having less stress when it comes time for product launch as well as how this helps to create a stronger foundation for business growth. "
      }
    ]
  },
  {
    "Id": 12,
    "FirstName": "Matthew",
    "LastName": "Edgar",
    "Bio": "Matthew Edgar is technical marketing and web analytics consultant at [Elementive](http://www.elementive.com). Since 2001, Matthew has helped hundreds of companies grow through a process of analyzing, optimizing, and improving their websites, search presence, and online marketing. Using a strong analytical and technical framework, Matthew helps clients understand all aspects of their website and online marketing to better connect with customers and grow their business. You can connect with Matthew on Twitter @MatthewEdgarCO.  ",
    "Website": "http://www.matthewedgar.net",
    "Twitter": "MatthewEdgarCO",
    "Photo": "/public/img/speakers/edgar-matthew.jpg",
    "Company": "Elementive (elementive.com)",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 12,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom C",
        "SessionNumber": 6,
        "Topic": "Using Data To Inform Development",
        "Description": "Data about the people using our websites and applications is all around us and, more and more, we're being asked to utilize that data when developing websites and applications. What is the right way to utilize all the data we have to understand priorities and needs when designing and developing applications and websites? Where are the best (and easiest) ways to access the data you need and how much data does a developer really need anyway?  More importantly, how do you communicate all those numbers to your boss, clients, funders, and other stakeholders in a way that makes sense and clearly shows the value of your work? <br/><br/>In this presentation, Matthew Edgar from Elementive will discuss specific, actionable steps you can use to make the wide variety of data you have available about your users a key part of your design and development work. Matthew will also share advice on how best to communicate and utilize those measurements and results. Attendees will leave with clear ideas on how to start utilizing and analyzing data. As well, attendees will have examples of how to collect that data. Attendees will also have a framework that they can apply to visualize and discuss the information gathered from the data with their teams."
      }
    ]
  },
  {
    "Id": 13,
    "FirstName": "A. Tate",
    "LastName": "Barber",
    "Bio": "Developer, husband, and DIY farmer.  I am a web developer at DaySpring Cards as well as a freelancer on the side in Northwest, AR. I manage an ecommerce store, write apps, and do cool stuff and things.",
    "Website": null,
    "Twitter": "tatemz",
    "Photo": "/public/img/speakers/barber-tate.jpg",
    "Company": null,
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 13,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom A",
        "SessionNumber": 5,
        "Topic": "Toolaholics Anonymous",
        "Description": "Do you use NodeJs, Composer, or Docker? Have you ever had your awesome code that you wrote on some new dev stack crap out on you the day before a project deadline? If so, you might be a toolaholic, like me.<br/><br/>Toolaholics are some of the coolest and smartest people out there, yet we lack the basics of productivity. We overcomplicate things and we spend way too much time trying to make our code as flexible as possible (when we should be making it as functional as possible).<br/><br/>This is a safe place to hear my mistakes and how I got over the hump of \"over tooling\" and how you can code better, stay more focused, and crank out some awesome work!"
      }
    ]
  },
  {
    "Id": 14,
    "FirstName": "Randy",
    "LastName": "Walker",
    "Bio": "A MicroISV owner for 11 years, Microsoft MVP for 8 years, and former Board member for INETA, Randy Walker has dedicated his life efforts towards fostering the software development community.",
    "Website": null,
    "Twitter": "_RandyWalker",
    "Photo": "/public/img/speakers/walker-randy.jpg",
    "Company": "Harvest Data Corp",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 14,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 5,
        "Topic": "SQL Server Scripting",
        "Description": "Loading from text files using BCP, parsing rows with cursors, temp tables, and crazy sub-queries!"
      }
    ]
  },
  {
    "Id": 15,
    "FirstName": "Sergio",
    "LastName": "Cruz",
    "Bio": "Sergio is an application developer who is passionate about learning and sharing knowledge. When he is not typing code at Code School, you may find him speaking at different events about topics he's learned recently.",
    "Website": "http://sergiocruz.me",
    "Twitter": "hashtagserg",
    "Photo": "/public/img/speakers/cruz-sergio.jpg",
    "Company": "Code School",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 15,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom A",
        "SessionNumber": 3,
        "Topic": "Staying Sane (dot) JS",
        "Description": "Developing apps with JavaScript is fun and scary in this day and age. It feels like every application we write will outlive the libraries used to write the app in... and that's not a fun feeling. Sometimes we get the impression that anything written in JavaScript today is so volatile because smart people will come up with smarter ways of solving problems, that will render solutions we write outdated about two minutes after writing it.<br/><br/>This issue was especially brought to life when I started working at Code School. How is it possible to prepare teaching materials that might be outdated by the time they get released? Turns out there is a way and I am here to prove to you that the JavaScript language and ecosystem is still a safe bet. Although there are parts of the ecosystem changing all the time, there are techniques we can use to prepare for those changes without having to rewrite whole apps over and over again.<br/><br/>Beginner & more advanced developers alike will draw value from this talk, as it will teach both of these groups how to collaborate in a productive manner when architecting and writing apps while getting ready for the unknown future."
      },
      {
        "Id": 1053,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom C",
        "SessionNumber": 4,
        "Topic": "Upgrading an Angular 1 app to Angular 2",
        "Description": "The time has come to upgrade your Angular 1.x app to Angular 2. The problem is that you used Babel, Browserify, and maybe even Gulp to bundle your app. How do you even start upgrading it all to Angular 2 & TypeScript? I’ll walk you through the upgrade process with a sample app and some live coding."
      }
    ]
  },
  {
    "Id": 17,
    "FirstName": "Matt",
    "LastName": "Shull",
    "Bio": "Matt Shull is Director of Aristotle Labs, which is a small team dedicated to creating innovative products using emerging technologies.  Because of his work in web performance, he was named one of the Top 60 Web Performance Experts to Watch by KeyCDN.  In his spare time he will tinker with the Internet of Things, hang out with his family, and occasionally, enjoy a demolition derby.  Catch him on twitter as @themattshull or check out other blog posts, videos, and information at mattshull.com.",
    "Website": "http://www.mattshull.com",
    "Twitter": "themattshull",
    "Photo": "/public/img/speakers/shull-matt.jpg",
    "Company": "Aristotle Labs",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 17,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 6,
        "Topic": "The Physical Web",
        "Description": "We've heard of the Internet of Things or the Physical Web, but how can we begin using it practically?  This talk explores how to use the web to create interactive content for users in the physical world through beacons.  By showing examples of how this technology has been used by amusement parks, businesses, and events, Matt will discuss how web developers are building the future of digital engagement for individuals and businesses.  You'll not only learn what the Physical Web is and how to use it but also participate in interactive displays with a few rewarding surprises.  The web is awesome, and the Physical Web is making it easier for users to get the content they want, when they want it."
      }
    ]
  },
  {
    "Id": 18,
    "FirstName": "Greg",
    "LastName": "Jordan",
    "Bio": "Greg Jordan is the Founder & CEO of Graph Story, the leading graph database-as-a-service provider.  Greg is also the author of Practical Neo4j and has over 15 years of programming experience in various languages with a focus on data driven projects. Greg is avid speaker and writer on the topic of graph databases and has been working with graph databases since 2011. Greg holds two Master's Degrees and is a Ph.D. candidate at the University of Memphis.",
    "Website": "https://www.graphstory.com",
    "Twitter": "gmjordan",
    "Photo": "/public/img/speakers/jordan-greg.jpg",
    "Company": "Graph Story",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 18,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom C",
        "SessionNumber": 2,
        "Topic": "Getting Started with Neo4j & .NET",
        "Description": "This workshop will focus on building a C#/.Net application using the Neo4j graph database as the database, including examples for social network application, geo / location matching and an ecommerce recommendation engine. It will include a mixture of theory, hands-on coding, and take home examples with a sample graph data.<br/><br/>Attendees will learn:<br/><br/>- An understanding of graph databases & use cases<br/>- Introduction to data modeling with Graph databases<br/>- Setting up a Neo4j instance and importing data<br/>- Understanding real-world examples with C#/.Net and Neo4j<br/>- Deploying your application to production<br/><br/>audience: intermediate level developers with some background .NET/C#"
      }
    ]
  },
  {
    "Id": 19,
    "FirstName": "Joseph",
    "LastName": "Yancey",
    "Bio": "Over the past 8 years, Joseph has been fortunate to climb the ranks from small web shops to a Senior Developer for Fortune 100 clients. Regardless of the scope of the project or client size, Joseph understands the importance of clean code and solid architecture for long-term growth. Raised in Northeast Arkansas but now calling Little Rock home, you can find him with his wife, 6-year old son and 2-year-old daughter.",
    "Website": null,
    "Twitter": null,
    "Photo": "/public/img/speakers/yancey-joseph.jpg",
    "Company": "Information Network of Arkansas",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 19,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom B",
        "SessionNumber": 1,
        "Topic": "Building a Highly Scalable Web Environment on AWS",
        "Description": "We moved a high-traffic application into AWS from a monolithic, self-hosted infrastructure back in 2014/2015.  We will talk about the trials, tribulations, and great successes of that endeavor.  We will provide an overview of our infrastructure setup, discuss the scalability and redundancy advantages that we've realized by using AWS, and then highlight some of the reason we think you should put your services in the cloud too."
      }
    ]
  },
  {
    "Id": 20,
    "FirstName": "Bruno",
    "LastName": "Genaro",
    "Bio": "I write code for Cisco, co-organize the OrlandoJS Meetup, married, father of two princesses, love Hardcore music and stage dives, passionate drummer and occasionally skateboarder.",
    "Website": "",
    "Twitter": "bfgenaro",
    "Photo": "/public/img/speakers/genaro-bruno.jpg",
    "Company": "Cisco",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 20,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom C",
        "SessionNumber": 1,
        "Topic": "The future of React with Universal web applications",
        "Description": "Everything started when Brendan Eich wrote a language to run Scheme on the Netscape Navigator. Then, Ryan Dahl got the Google's V8 JavaScript runtime and developers would write JavaScript on the server side. <br/><br/>Nowadays people write JavaScript everywhere (web servers, to fly drones, tablets, mobile phones, refrigerators etc). Isomorphic JavaScript is used to describe JavaScript code that “can be executed on the client and the server”.<br/><br/>React has a powerful ability to render also on the server side. This is huge for perfomance and SEO. Also, sharing the same code between client and server makes maintenance much easier."
      }
    ]
  },
  {
    "Id": 21,
    "FirstName": "Timi",
    "LastName": "Roberts",
    "Bio": "A web nerd that grew up hearing the tales of Assembly and chose the easy route of HTML and JS. After over a decade of hacking together SO questions and other people's source code to make websites and applications that work, I have landed as the JavaScript Evangelist at KnoxWeb, the oldest web development firm in Knoxville, TN. I currently am helping bridge the gap between designers and developers, trying to talk code with one and colors with the other and bring both into the world of Functional programming.<br/><br/>I am a huge React nerd, Redux admirer, and a lover of ES6 (never 2015...). I like to give back to the community in gist form over repo form, blogs over talks, and questions over answers. <br/><br/>github.com/beardedtim<br/>gist.github.com/beardedtim",
    "Website": "http://github.com/beardedtim",
    "Twitter": "circa",
    "Photo": "/public/img/speakers/roberts-timi.jpg",
    "Company": "KnoxWeb",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 21,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom A",
        "SessionNumber": 2,
        "Topic": "Dr Iterate or: How I Learned to Stop Worrying and Love Higher-Order Functions",
        "Description": "_**The journey of a thousand miles begins with one step**_<br/><br/>Functional programming seems to be the coming paradigm for building software and for good reason. Stateless functions produce less bugs and help build modular, reusable code. But making the switch from OOP to functional can be a daunting task. Monads? Functors? Category Theory? What do any of these words mean and how can you actively apply them to the code-base you are currently working on or the project your team is starting?<br/><br/>The easiest way to get your feet wet into functional programming in JavaScript is the use of higher-order functions (reduce, filter, map, etc). From the basics of what the syntax is and how it is different than forEach to the power of stateless, composable functions, learning how and why to use higher-order functions will speed up the transition from OOP to functional. Learn how to use and chain together higher-order functions, building uber-microservices, refactoring along the way."
      }
    ]
  },
  {
    "Id": 22,
    "FirstName": "Bryan",
    "LastName": "Soltis",
    "Bio": "Bryan Soltis is the Technical Evangelist at Kentico and an avid .NET developer. With over 16 years of web development experience, Bryan has completed projects for Microsoft, IMG, HP, and other Fortune 500 companies. A former Azure VTSP, Bryan has developed numerous applications with Microsoft’s cloud and Kentico, including custom software development, integrated solutions, and globally-available enterprise applications. As a Technical Evangelist, Bryan enjoys working with the development community and educating developers on best practices, new technologies, and utilizing the .NET, cloud, and Kentico to their fullest potentials. And he really likes beer.",
    "Website": "http://devnet.kentico.com/users/439927/bryan-soltis",
    "Twitter": "bryan_soltis",
    "Photo": "/public/img/speakers/soltis-bryan.jpg",
    "Company": "Kentico",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 22,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom B",
        "SessionNumber": 2,
        "Topic": "Long walks on the beach with Azure Search ",
        "Description": "Azure Search is a powerful, REST-based service companies can leverage within their applications to provide dynamic, scalable search solutions. In this session, Kentico Technical Evangelist and Azure enthusiast Bryan Soltis will introduce you to this powerful service, show you some of its cool capabilities, and see if there’s a love connection for you. From Creating Indexes to Custom Search functions, you’ll see how Azure Search can quickly boost the functionality of any site and provide a unique and captivating experience for your users."
      },
      {
        "Id": 1056,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom A",
        "SessionNumber": 5,
        "Topic": "Why Azure Functions Should Be Your New Best Friend",
        "Description": "Azure Functions are pretty awesome. They can automate processes, offload functionality, and simplify your life in a ton ways.  In this session, Kentico Technical Evangelist Bryan Soltis will show you to leverage this cloud-based functionality to offload your dirty work, alleviate headaches, and provide you a Luigi to your Mario when you need it."
      }
    ]
  },
  {
    "Id": 23,
    "FirstName": "Gian",
    "LastName": "Wild",
    "Bio": "Gian Wild is the CEO of AccessibilityOz. She has worked in accessibility industry since 1998. Her major achievements include: the very first Australian accessible web site; the accessibility compliance of the Melbourne 2006 and Gold Coast 2018 Commonwealth Games; her six years’ active membership in the W3C Web Content Accessibility Guidelines Working Group; and her speech on the importance of web accessibility at the United Nations Conference of State Parties in June last year. Gian has spoken at conferences in Australia, US, Canada, South America and Europe.<br/>",
    "Website": "http://www.accessibilityoz.com",
    "Twitter": "accessibilityoz",
    "Photo": "/public/img/speakers/wild-gian.jpg",
    "Company": "AccessibilityOz",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 23,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom C",
        "SessionNumber": 2,
        "Topic": "Mobile and accessibility",
        "Description": "Mobile accessibility is different to desktop accessibility; there are a whole lot more devices, screen sizes, operating systems and browsers. What this means for accessibility is that things can often go very very wrong and unfortunately it is not a case of just following WCAG2. Gian Wild looks at some major mobile accessibility failures, and some plain old usability failures as well; and talks about what should be done instead.<br/>Some of the issues Gian talks about is the use of PDFs, and their problems on mobile devices: from the longer download time to display issues. She also talks about issues with keyboard accessibility – whether this is to do with access to the onscreen keyboard or accessibility of an external keyboard device. She talks about text sizing issues, and the inability to change text size in some systems. Gian talks about the use of colour in mobile sites and how important colour contrast is important on smaller screen devices. She talks about the effects on the user of broken or unclear functionality, and how the user responds to different or inconsistent functionality on the desktop versus mobile device. Other issues include source order, size of touch targets, spacing between elements and use of images."
      }
    ]
  },
  {
    "Id": 24,
    "FirstName": "Jeffrey",
    "LastName": "Hicks",
    "Bio": "Hi, I'm Jeff. I develop for emergency responders where new app releases are measured in hours (not weeks).  I'm an early adopter from the trenches trying to cut through the hype to extract usable, pragmatic nuggets. I'm an experienced presenter who knows developers are interested in clearly presented, clearly researched, and easily demonstrated findings; and I've never had a topic more magnetizing than this presentation on \"Going from Zero to Production Docker in 10 minutes.\"",
    "Website": "http://jrhicks.github.io",
    "Twitter": "jrhicks",
    "Photo": "/public/img/speakers/hicks-jeffrey.jpg",
    "Company": null,
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 24,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom C",
        "SessionNumber": 1,
        "Topic": "From Zero to Production Docker in 10 minutes ",
        "Description": "It is important to see Docker as a logical, inevitable, and long-awaited next step in a decades-long struggle for adequate packaging. This struggle has been equally and independently shared by each successful language and its ecosystem. We briefly reminisce on Ruby’s, PHP's, and .NET’s history of packaging and reflect on how each type of innovation has enabled new simplifications and abilities to deliver and make reliable our applications.<br/><br/>Each innovation in packaging has spawned new complimentary tools. Similarly, docker and containers have spawned a dizzying assortment of complimentary tools; but luckily we are starting to see a clear winner. Meet Kubernetes and learn about its latest features. Be amazed by a 10-minute live demonstration of going from zero to production docker."
      }
    ]
  },
  {
    "Id": 25,
    "FirstName": "Christopher",
    "LastName": "Steven",
    "Bio": "Christopher Steven has spent the last 15 years developing Line of Business Software for the health care industry in the Central Arkansas Region and the last 2 years developing ground breaking software for Dassault Falcon Jet . He has a passion for technology, mentoring aspiring developers to embrace software engineering and to always look towards the future. Christopher is a Microsoft Certified Professional Developer, an Alumni of Pulaski Technical College and the University of Arkansas. He is currently the President of the Little Rock .Net User Group.",
    "Website": "http://lrdnug.org/",
    "Twitter": "Chrissteven81",
    "Photo": "/public/img/speakers/steven-christopher.jpg",
    "Company": "Dassault Falcon Jet",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 25,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom A",
        "SessionNumber": 4,
        "Topic": "Hololens: Demonstration and Workshop",
        "Description": "We begin our journey into the next evolution in computing by performing a demonstration. We will then take a dive into how to get started and some tips and tricks you will need to know along the journey."
      }
    ]
  },
  {
    "Id": 26,
    "FirstName": "Josh",
    "LastName": "Cypher",
    "Bio": "Josh Cypher is the lead QA Engineer at Emma, Inc. Before Emma, he spent five years as a product manager, learning to code in an effort to better understand his developers. When he took the leap into automated testing, he never looked back. <br/><br/>Josh is an avid cyclist and often commutes to work on his Bianchi road bike. In his off hours, he enjoys spending time with his wife, Rachel, and his dog, Alistair. He is a board game enthusiast, beer aficionado and an excellent campfire cook.<br/>",
    "Website": null,
    "Twitter": "joshuacypher",
    "Photo": "/public/img/speakers/cypher-josh.jpg",
    "Company": "Emma, Inc.",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 26,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom C",
        "SessionNumber": 3,
        "Topic": "Jumpstarting Selenium Testing in Your Organization with Javascript, WebdriverIO & Cucumber",
        "Description": "With modern software development moving at a rapid pace, automation engineers may find it difficult to keep up with frequent changes. But if parts of the testing process are incorporated into everyone's workflow, this creates the potential for automated testing to mirror software delivery.<br/><br/>My goal is to make software testing more accessible to entire product and engineering teams by providing familiar tools that allow individuals to easily contribute to the automation process.<br/><br/>For this talk, I will explore how we can meet developers halfway by using the javascript-based testing framework WebdriverIO, demonstrate how product managers can create living documentation and test cases using Cucumber, and talk about sharing page objects and testing libraries across multiple services using NPM. "
      }
    ]
  },
  {
    "Id": 27,
    "FirstName": "Russell",
    "LastName": "Anderson",
    "Bio": "Russ Anderson is a Front-End Developer and de facto UI/UX designer at SimplyAgree, and has been writing Javascript for about 5 years. These days he spends most of his time writing Angular 1.x applications because that's what he gets paid to do. Regardless of the framework he loves building intuitive practical interfaces, and heavily commented pull requests. Also he likes that most recent Car Seat Headrest record.<br/><br/>Russ lives in Nashville, Tennessee with his wife and two boys.",
    "Website": "http://vacas5.github.io/",
    "Twitter": "RealRealRuss",
    "Photo": "/public/img/speakers/anderson-russell.jpg",
    "Company": "SimplyAgree",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 27,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom A",
        "SessionNumber": 4,
        "Topic": "\"This Code Sucks\" and other tales of developer hubris",
        "Description": "### \"This Code Sucks\" and other tales of developer hubris<br/><br/>I'll admit it, I'm guilty of the \"not invented here\" fallacy. I have my pattern and habits and I'm comfortable sticking to them. There are certain frameworks I want to work in, and others I don't. I also want to stay on the cutting edge, and not get left behind. And in the Javascript world, if you're asking me to maintain this old legacy application, then, well, you've got to be kidding. How about I just rewrite it using \"x\"?<br/><br/>This is a cautionary tale of one developer whose self-importance has led him down a very dark path of refactoring, and the pain he found therein. No, really, this talk is a call to reconsider huge sweeping rewrites in favor of smaller, more manageable refactoring. It also will discuss how to go about decisions to refactor, tools that might help make it easier, and potential pitfalls (namely, regressions).<br/><br/>You can improve your codebase, improve your skills, and still meet deadlines. Let's talk about how."
      }
    ]
  },
  {
    "Id": 31,
    "FirstName": "Nick",
    "LastName": "Volgas",
    "Bio": "Nick Volgas was born in Memphis, TN and moved to Little Rock, AR in 2011 to work for INA.  He started as a software developer, then senior developer (when he worked on this project), and has recently moved into a team lead position.  He is passionate about using AWS and other cloud solutions instead of self-hosting a monolithic architecture.  Nick is an avid mountain biker, homebrewer, and spends his little remaining free time with his wife and dog.",
    "Website": null,
    "Twitter": null,
    "Photo": "/public/img/speakers/volgas-nick.jpg",
    "Company": "Information Network of Arkansas",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 32,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom B",
        "SessionNumber": 1,
        "Topic": "Building a Highly Scalable Web Environment on AWS",
        "Description": "We moved a high-traffic application into AWS from a monolithic, self-hosted infrastructure back in 2014/2015.  We will talk about the trials, tribulations, and great successes of that endeavor.  We will provide an overview of our infrastructure setup, discuss the scalability and redundancy advantages that we've realized by using AWS, and then highlight some of the reason we think you should put your services in the cloud too."
      }
    ]
  },
  {
    "Id": 33,
    "FirstName": "David",
    "LastName": "Walker",
    "Bio": "David Walker is a Sitecore 2015 Technology MVP and Associate Director - Digital Services for VirtusaPolaris.com. He has over twenty years of experience in application development and lifecycle management with over eighty percent of that as a consultant. He has been an MCP since 2003, MCAD and MCSD since 2005 and was a Microsoft MVP - ASP/ASP.NET from July 2007 - July 2009. He has been hooked on Sitecore, since achieving his 5.1 certifications in 2007.<br/><br/>David Walker is a Sitecore 2015 Technology MVP and Associate Director - Digital Services for Virtusa.com. He has over twenty years of experience in application development and lifecycle management with over eighty percent of that as a consultant. He has been an MCP since 2003, MCAD and MCSD since 2005 and was a Microsoft MVP - ASP/ASP.NET from July 2007 - July 2009, before he joined Microsoft as a Senior Application Development Manager where he mentored numerous Fortune 100 companies on full Application Lifecycle Management and Software Development best practices.<br/><br/>He has delivered over ninety presentations, including events like: Microsoft TechEd, VSLive! Dallas, VSLive! Austin and numerous User Groups, CodeCamp's, TechFests and other community conferences.<br/>  <br/>He was formerly a board member for INETA (Vice President, Speakers Bureau), President of the Tulsa Developers .NET users group, founder and President of the Tulsa SQL Server Group and Tulsa Java Developers Group, and Vice President of the Tulsa SharePoint Interest Group. He has been the Chairman of the region's largest and highly successful technical training event, just finishing its tenth consecutive successful year, TulsaTechFest.com. He is the founder and current President of the Houston Sitecore User Group.<br/><br/>Since writing his first SharePoint assembly in 2004, he has been focused on Enterprise/Web Content Management Systems. He has been sold on Sitecore, since gaining his 5.1 certifications in 2007. He has worked with numerous CMS systems (proprietary, commercial and open source). He has worked on very high traffic eCommerce sites, including one with a daily sales volume record of over six million dollars and over one and half million microsites.",
    "Website": "http://radicaldave.com",
    "Twitter": "davidwalker",
    "Photo": "/public/img/speakers/walker-david.jpg",
    "Company": "VirtusaPolaris",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 34,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom A",
        "SessionNumber": 6,
        "Topic": "Integration Intoxication",
        "Description": "Learn how to maximize your integration efforts between existing applications (Sitecore or any other application) and any other third-party API's and systems. Start with just a few basic samples all the way to deep integration with third-party API, in fact an intoxicating amount, many of which you've likely never heard of. Leverage and future-proof these in your Sitecore solutions, while keeping up with the future wave of ASP.NET Core and other technology shifts.<br/><br/>Customers want to maximize the investment (money they spend) on customization and integration. Write the right code, the right way, to provide the most reusability across all of the Sitecore Experience Platforms integration points.<br/><br/>Learn about numerous third-party API's - over 40+.<br/>Learn how to minimize the impact of API changes and Sitecore upgrades.<br/>Learn how to embed, integrate and compile code from within content.<br/>Learn how to recognize when and how they should abstract their code into reusable components.<br/>Introduction to ASP.NET Core 1 (formerly ASP.NET 5)<br/><br/>Customized code can be harder to maintain. Save money and increase reusability. Just step back and think about it before you code.<br/><br/>Numerous Third Party API Integration Techniques With AND Without Sitecore<br/><br/>Best Practices / Lessons Learned while building Advanced/Reusable Third Party API Integration Technologies<br/><br/>Maxmized code reusability across - Sitecore 7.2, 7.5, 8, WinForms, ASP.NET and ASP.NET Core 1."
      }
    ]
  },
  {
    "Id": 34,
    "FirstName": "Erin",
    "LastName": "Page",
    "Bio": "Erin is a US Army Veteran, mom to two brilliant teenage boys, and Web Application Developer at Reax. She helps organize Nash.rb and BarCamp Nashville. Erin is a go-go-go kind of person: go getter, go-to, go team!! When she is not mentoring or hacking, she can be found transporting teenagers around Nashville.",
    "Website": "http://erinpagemd.com",
    "Twitter": "erinmpage",
    "Photo": "/public/img/speakers/page-erin.jpg",
    "Company": "Reax",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 35,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom B",
        "SessionNumber": 6,
        "Topic": "From Muggle to Software Engineer ",
        "Description": "Bootcamp attendance is on the rise as more and more people are considering a career in software development. How does one go about actually learning how to program? How do you break into the market and convince someone to hire you??<br/><br/>In this talk, I will share my path from self learning to bootcamp to actual paid software engineer, and leave attendees with some advice on next steps on their own journey."
      }
    ]
  },
  {
    "Id": 35,
    "FirstName": "Nancy",
    "LastName": "Gaines",
    "Bio": "As an international speaker, bestselling author, and productivity expert, Nancy Gaines assists and mentors C-level and small business owners to massively grow their companies. She is the Founder and CEO of Gain Advantages, Inc. Using her products and systems, individuals and corporations gain a competitive advantage with proven productivity accelerators.<br/><br/>Nancy spent almost two decades consulting to IBM’s Fortune 500 clients including AIG Insurance, Shell Oil, Lenovo, Office Max, Clorox, and even IBM itself. She provides knowledge that assists others to be even more successful - fast. Nancy is frequently quoted online, in magazines, and in books as a business expert. Listen to her podcast, The Nancy Gaines Show, downloaded in over 50 countries on iTunes and read her books which are available on Amazon.",
    "Website": "http://www.nancygaines.com/",
    "Twitter": "NancyLGaines",
    "Photo": "/public/img/speakers/gaines-nancy.jpg",
    "Company": null,
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 37,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom C",
        "SessionNumber": 6,
        "Topic": "From Mess to Success … How Simple Organization Leads to Mastery - 3 Secrets to Win at Organizing for Higher Performance",
        "Description": "Do you feel busy but not productive? Could being a bit more organized make you a lot more successful? It costs almost nothing to get organized, but the paybacks are exponential. Master the same techniques top performer use and increase your success. Simply get organized to transform into super high productivity with lasting results. In this session you will learn how organized people: -\tEarn more and are more successful in life -\tAccomplish more by being laser focused on the right things -\tSave time, money, and have more free time to do things they enjoy -\tFeel more relaxed and experience less stress You know your time is valuable, so get organized so you can savor every moment and focus on what really matters to you – family, fun, friends, and more."
      }
    ]
  },
  {
    "Id": 36,
    "FirstName": "Addam",
    "LastName": "Hardy",
    "Bio": "Addam Hardy is a Senior Software Engineer and Senior Consultant at Lofty Labs in Fayetteville, AR. He's also an 8 year Army Veteran with over 10 years experience in software engineering working for various types of companies ranging from the National Security Agency, the Department of Defense, as well as several startups founded in Northwest Arkansas. ",
    "Website": "http://addamhardy.com",
    "Twitter": null,
    "Photo": "/public/img/speakers/hardy-addam.jpg",
    "Company": "Lofty Labs",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 38,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom B",
        "SessionNumber": 5,
        "Topic": "Introduction to MLlib on Apache Spark",
        "Description": "Apache Spark is an emerging cluster computing platform that allows data processing programs to run up to 100x faster than Hadoop MapReduce in memory, or 10x faster on disk. Spark also has a built in machine learning library, MLlib, that implements many common supervised and unsupervised machine learning algorithms. In this talk we will discuss how Spark has improved cluster computing and data processing along with an overview of the MLlib algorithms available. After getting familiar with the basics, we will explore how you can create a product recommendation engine for eCommerce utilizing Collaborative Filtering and the Alternating Least Squares algorithm. "
      }
    ]
  },
  {
    "Id": 1035,
    "FirstName": "Clayton",
    "LastName": "Hall",
    "Bio": "My name is Clayton Hall, father of five, pastor, and sometimes adventurer. I have been developing solutions using Microsoft technologies for 19 years.",
    "Website": null,
    "Twitter": "_the_coder",
    "Photo": "/public/img/speakers/hall-clayton.jpg",
    "Company": "DataPath",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1036,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom A",
        "SessionNumber": 3,
        "Topic": "Ready For Redis?",
        "Description": "Technologies like Intel's Optane and the 3D Xpoint could revolutionize how and where computers access data.<br/>The idea of creating and modifying objects that can exist forever without ever explicitly saving their state can be a little mind blowing. After watching some demonstrations of Azure Service Fabric stateful services and Reliable Collections, I was intrigued with the idea and sought to see what could be done with existing technology. In this talk, We'll explore how Redis can be used to change the way applications think about interact with data.<br/>"
      }
    ]
  },
  {
    "Id": 1036,
    "FirstName": "Jeremy",
    "LastName": "Abbott",
    "Bio": "I'm a software architect at Shreveport development shop Praeses, where I work as a project architect, developer, and recruiter. I work hard to deliver clean, extensible, and maintainable solutions to customers' business problems. I'm passionate about software as a profession and craft and work to cultivate that mindset in my team members through constant training.<br/><br/>When I'm not writing code I'm advocating for LGBT equality.",
    "Website": "http://jeremyabbott.github.io/",
    "Twitter": "mrjabbott",
    "Photo": "/public/img/speakers/abbott-jeremy.jpg",
    "Company": "Praeses",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1037,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom B",
        "SessionNumber": 4,
        "Topic": "Writing Functional Web Apps in F# w/ Suave",
        "Description": "F# is a multi-paradigm language for the .NET Framework that emphasizes functional programming and immutable data structures. In this talk we'll explore how to use the language features of F# along with the Suave Web Server and Application framework to write a fast, easy to understand web application. Experience with F# is helpful for this talk, but we will also discuss the different language idioms as they are used."
      }
    ]
  },
  {
    "Id": 1037,
    "FirstName": "Sean",
    "LastName": "Hill",
    "Bio": "Sean is currently herding junior software developers in Nashville, Tennessee as the founder of Reax, and as the organizer of the Software Beginners Meetup in Nashville.  He also organizes the Nashville Ruby User Group, Nash.rb, and volunteers at conferences around Nashville, like Nodevember.  He is extremely passionate about paying it forward through mentorship and teaching and is a partner employer of Nashville Software School.<br/><br/>In his free time... wait... he has no free time.",
    "Website": "https://www.reax.io",
    "Twitter": "solusean",
    "Photo": "/public/img/speakers/hill-sean.jpg",
    "Company": "Reax",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1038,
        "Track": null,
        "Day": 2,
        "Room": "Ballroom C",
        "SessionNumber": 5,
        "Topic": "Intro to Phoenix",
        "Description": "The real time web is upon us.  With the physical web, the Internet of Things, increasing social engagement,  and real time analytics, web frameworks that offer real time capabilities are essential to the future of the web.  <br/><br/>In this talk, we will discuss the Phoenix Web Framework and how to build real time applications. We will cover the basics of how to get started, from installing Elixir and Phoenix, to covering the different components of the framework, and leveraging WebSockets and GenServers to create real time applications, leveraging the awesomeness that the Erlang VM has to offer and the developer friendliness that comes with Elixir.  "
      }
    ]
  },
  {
    "Id": 1038,
    "FirstName": "Ryan",
    "LastName": "Rousseau",
    "Bio": "I am a Senior Software Engineer at JCPenney where I focus on build and deployment automation. I have worked on .NET applications for 9 years, but my pet projects have always dealt with automating annoying tasks and making build and deploy pipelines better.<br/><br/>I am a cat person, board-gamer, and podcast addict. I will talk to you about all of these things if you give me a chance. I might even have a game with me to play.",
    "Website": null,
    "Twitter": "ryanrousseau",
    "Photo": "/public/img/speakers/rousseau-ryan.jpg",
    "Company": "JCPenney",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1039,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom A",
        "SessionNumber": 6,
        "Topic": "My Journey to Continuous Delivery",
        "Description": "From an early point in my career, I've been fascinated with automation. Naturally, this lead me to continuous integration and continuous delivery. In this session, I'll share my journey to continuous delivery sharing tools, tips, successes, and failures along the way."
      }
    ]
  },
  {
    "Id": 1041,
    "FirstName": "Andy",
    "LastName": "Cowles",
    "Bio": " Andy Cowles is a Founder and Managing Partner of Elyxor. Prior to founding Elyxor, Andy was a founder of CoBu Technology, a Boston-based software consulting company, in 2008. CoBu's expertise included delivering mobile and desktop applications, server architecture and design, performance engineering, and agile process implementation. Andy started his career in military R&D for the Mitre Corporation before joining the supply-chain startup Celarix in 1999 as a principle software engineer and tech lead. After Celarix, Andy led development at several early-stage startups in the mobile space, including Quantia and Opus3Media. He has extensive experience in cross-platform mobile development as both a hands-on contributor and team leader and possesses a keen understanding of development and delivery of production-ready software. Andy earned a BS in Computer Science from Tufts University and an MS in Computer Science from the University of Massachusetts Lowell.",
    "Website": null,
    "Twitter": null,
    "Photo": "/public/img/speakers/cowles-andy.jpg",
    "Company": "Elyxor",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1043,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 4,
        "Topic": "DevOps Panel",
        "Description": "DevOps is a topic being discussed in many software engineering organizations, but the scope of DevOps is not consistent across these organizations.  The members of this panel will share their views regarding the different teams in your company that need to participate in DevOps and the importance of looking at your entire SDLC.  In 'The Complete Picture' of DevOps, this set of panelists discuss how software developers, software developers in Test (SDET), and IT operations all play a role in evolving your DevOps process. When done correctly, the entire velocity of your organization will increase, and your business will realize greater innovation speed, reduced risk, improved capacity, and increased uptime.  The panel will share approaches and real-life examples that discuss DevOps related to new development efforts and uplifting the legacy development processes."
      }
    ]
  },
  {
    "Id": 1045,
    "FirstName": "Pete",
    "LastName": "Buletza",
    "Bio": "Pete Buletza is a Founder and Managing Partner of Elyxor. Previously he co-founded Cobu Technology, a Boston-based software consulting firm specializing in mobile solutions. CoBu's primary work involved mobile and desktop application development, server architecture and design, performance engineering, and agile process implementation. Mr. Buletza got his start working on TurboTax and WebTurboTax at Intuit; he later returned to Boston and joined the startup scene, spending the subsequent 10 years architecting systems, building software, and managing the teams that provide the technology to make entrepreneurs‘ visions a reality. Mr. Buletza spent several years as the System Architect of high-volume, scalable systems, most notably at Celarix and Espanol.com. His focus over the past 7 years has been providing SDLC consulting and DevOps implementations to accelerate innovation and minimize risk for Elyxor's customers. Mr. Buletza holds a BA in Computer Science from Harvard University.",
    "Website": null,
    "Twitter": "buletza",
    "Photo": "/public/img/speakers/buletza-pete.jpg",
    "Company": "Elyxor",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1049,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 4,
        "Topic": "DevOps Panel",
        "Description": "DevOps is a topic being discussed in many software engineering organizations, but the scope of DevOps is not consistent across these organizations.  The members of this panel will share their views regarding the different teams in your company that need to participate in DevOps and the importance of looking at your entire SDLC.  In 'The Complete Picture' of DevOps, this set of panelists discuss how software developers, software developers in Test (SDET), and IT operations all play a role in evolving your DevOps process. When done correctly, the entire velocity of your organization will increase, and your business will realize greater innovation speed, reduced risk, improved capacity, and increased uptime.  The panel will share approaches and real-life examples that discuss DevOps related to new development efforts and uplifting the legacy development processes."
      }
    ]
  },
  {
    "Id": 1048,
    "FirstName": "Scott",
    "LastName": "Jones",
    "Bio": "Scott Jones is a Principal Architect at Acxiom Corporation.  He specializes in API designs, ultra-low latency system designs and full stack designs to solve business needs.  He has three patents pending for the leading edge Ad Tech Platform technology.  His innovative design started with the platform concept, implementation and ultimately the execution of a system that processed 3 billion transactions a day, against a terabyte of data, with transactions averaging 2 mls per transaction.  Mr. Jones also serves as one of Acxiom’s Privacy Engineers, with expert skills applying nuanced next-gen data governance concepts at the engineering layer. Previously he worked for Alltel Information Services the predecessor to FIS.  Mr. Jones serves as a mentor at The Venture Center and as an advisor to one of the 2016 VC FinTech Accelerator companies, Monotto.  Mr. Jones holds a BS in Computer Science from Arkansas Tech University.<br/>",
    "Website": null,
    "Twitter": null,
    "Photo": "/public/img/speakers/jones-scott.jpg",
    "Company": "Acxiom",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 1055,
        "Track": null,
        "Day": 1,
        "Room": "Ballroom B",
        "SessionNumber": 4,
        "Topic": "DevOps Panel",
        "Description": "DevOps is a topic being discussed in many software engineering organizations, but the scope of DevOps is not consistent across these organizations.  The members of this panel will share their views regarding the different teams in your company that need to participate in DevOps and the importance of looking at your entire SDLC.  In 'The Complete Picture' of DevOps, this set of panelists discuss how software developers, software developers in Test (SDET), and IT operations all play a role in evolving your DevOps process. When done correctly, the entire velocity of your organization will increase, and your business will realize greater innovation speed, reduced risk, improved capacity, and increased uptime.  The panel will share approaches and real-life examples that discuss DevOps related to new development efforts and uplifting the legacy development processes."
      }
    ]
  }
]