[
	{
		"Id" : 1,
		"FirstName": "Taylor",
		"LastName": "Otwell",
		"Bio": "<p>Taylor is one of the top 10 most active Github users in the world, as well as the creator of the Laravel PHP web framework, which is the most popular PHP web framework on Github. A lifetime Arkansan, Taylor is passionate about all things web and is a Software Engineer for UserScape as well as the founder of Forge, a PHP server provisioning and deployment service.</p>",
		"Website": "http://taylorotwell.com",
		"Twitter": "taylorotwell",
		"Photo": "/public/img/speakers/taylor_otwell.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track":"Web",
				"Topic": "Intro To Angular.js",
				"Description": "<p>Angular.js is a powerful JavaScript framework developed by Google, and you can totally learn how to use it! In this talk we'll cover the basics of Angular with live code and demos, using Laravel PHP to power the back-end JSON API.</p><p>Demo will include setting up an Angular application, pulling JSON from a server, binding data to your view, posting data from a form, and showing error and success messages. All \"real world\" stuff you can use in your applications, even if they aren't fancy single page applications!</p><p>We'll also check out some other web related goodies like Gulp.js for compiling our CSS (LESS) and JavaScript files.</p>"
			}
		]	
	},
	{
		"Id" : 2,
		"FirstName": "Mark Anthony",
		"LastName": "McCray",
		"Bio": "<p>Mark Anthony McCray is a speaker, financial counselor and entrepreneur - the last label basically means he's always open to new opportunities so see talk to him after the program. His passion is helping people get beyond their spiritual, emotional, financial, and entrepreneurial and LIFE limitations. He is committed to killing IGNORANCE and hopelessness worldwide!</p>  <p> Known as a knowledgeable and inspiring teacher, Mark Anthony has launched several businesses, worked in full-time ministry and served on multiple advisory boards such as the Austin CDC Entrepreneur Development Program, Collegiate Entrepreneurs Organization and the Texas State University: - Management & Marketing Advisory Council. He currently lives and works in Houston but is planning to spend more time out here in God's country so don't hold that against him. <p> He gets great joy from teaching people how to find hope, learn winning methods and then helping them in their life journeys. Mark has assisted thousands of entrepreneurs with their consulting, business and financial planning needs through his seminars, workshops, outreach programs, radio Interviews, published articles, coaching and mastermind groups. For more information about Mark, check out: <a href=\"http://livebigdieempty.blogspot.com/p/about-mark_29.html\">http://livebigdieempty.blogspot.com/p/about-mark_29.html </a></p> <p> Most important, he's always happy to share!</p>",
		"Website": "http://livebigdieempty.blogspot.com",
		"Twitter": "LiveBIGDieEmpty",
		"Photo": "/public/img/speakers/mark_mccray.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track":"Other",
				"Topic": "Social Media Success for Influencers",
				"Description": "<p>In today’s business world, there is a shift in the way we are all communicating. You must keep up in order to stay relevant and to connect with clients in today’s marketplace. I have specifically designed this presentation exclusively for professionals just like you including tangible ready-to-use approaches! Attendees will learn:</p><p>How to blog for profit and purpose<br/>Where to find your current and prospective clients on the internet.<br/>How to brand yourself, your products and your services.<br/>How to build and maintain a relationship online.<br/>How to optimize your visibility on the internet.<br/>How to convey your expertise in order to build client confidence in you.<br/>How to manage your social media effort in a consistent way.</p><p>How can you as a professional speaker, coach, expert and business leader use social media and traditional marketing approaches to effectively and profitably monetize your online presence and market position? Why should you as a professional want to learn the strategy and tools of social media? It’s very simple: LEVERAGE!</p><p>Social media isn't going away and more and more, if you aren't taking advantage of the best tools, techniques and approaches, YOU ARE BEING LEFT BEHIND. You already know what I'm saying. You know you need to:<br/><br/>1. Get new clients<br/>2. Maintain and grow your current client relationships<br/>3. Find ways to monetize your commitment to social media.<br/><br/> ...and do it all with panache!</p>"
			}
		]	
	},
	{
		"Id" : 3,
		"FirstName": "Seth",
		"LastName": "Fendley",
		"Bio": "<p>Seth Fendley has been an Inbound Marketing Specialist and Project Manager at ClearPivot for 3 years. Currently pursuing he is Masters in Communication Studies from Arkansas State University. In pursuing his graduate degree he is actively researching ways for businesses to stay ahead of the social media curve. In his spare time you can find him working as the Assistant Debate Coach for Arkansas State and representing the university as the team captain of their disc golf team.</p>",
		"Website": "http://www.clearpivot.com",
		"Photo": "/public/img/speakers/seth_fendley.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track":"Collaboration and Content Management",
				"Topic": "Telecommuting 101: Tips & Tricks to effectively managing projects online",
				"Description": "<p>Today it is easier than ever to work from home. Understanding how to effectively manage your web development and inbound marketing projects online will help speed up project timelines and make working from home a breeze. From Google Drive to GoToMeeting, in this session you will learn all of the tips and tricks from a native Arkansan with 3 years telecommuting experience working for a company based in Denver, Colorado.</p>"
			}
		]	
	},
	{
		"Id" : 4,
		"FirstName": "Dustin",
		"LastName": "Williams",
		"Bio": "<p>Dustin started life as a developer, which influences his design. He draws on keen understanding, experience, seeing, and confidence to design with clean lines and strong user focus. Dustin has worked for many Fortune 500 companies & startups, often employing user research to focus on user experience.</p> <p>Dustin’s many specialties all have “user experience” at their core. They include Interaction Design, User Interface Design, Website Design, Website Development, Conversion Rate Optimization, User Testing and Usability. With a strong user experience background and deep understanding of the production process, Dustin is well equipped to conceive innovative experiences, but also manage the execution of those ideas down to the pixel.</p> <p>Dustin is deeply rooted in the Arkansas Startup Eco-System and is currently a founding partner of a startup (BourbonAndBoots.com). Dustin is a supporter of the Arkansas Venture Center, an organizer in the Little Rock, AR chapter of 1 Million Cups and a past Mentor for The ARK Challenge Northwest Arkansas.</p> <p> While living in Seattle, Dustin worked with Microsoft Mobile, Microsoft Zune and TEAGUE. Dustin has also worked with Arkansas based companies such as Walmart and Acumen Brands (CountryOutfitter.com).</p>",
		"Website": "http://www.dustinowilliams.com",
		"Twitter": "dustinowilliams",
		"Photo": "/public/img/speakers/dustin_williams.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "UI/UX",
				"Topic": "Using data to design killer experiences for your user",
				"Description": "<p>We'll explore why designers should be designing experiences for the user and not for the boss or themselves. Dustin will showcase tools that he used for User Research, A/B Testing, Usability Testing, Prototyping, and Design. </p><br/><p>Dustin will also explain his process on:<br/>-- How he farms customer/user data from research<br/>-- What to do with the customer/user data once obtaining it<br/>-- How to use design to solve problems<br/>-- How to use A/B Testing to test design ideas<br/>-- What his iteration cycle looks like</p>"
			}
		]	
	},
	{
		"Id" : 5,
		"FirstName": "Ryan",
		"LastName": "Rousseau",
		"Bio": "<p>Ryan has been programming for over 10 years in various languages and platforms. He is always trying to find ways to automate and make cumbersome processes easier.</p>",
		"Website": "",
		"Photo": "/public/img/speakers/ryan_rousseau.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Other",
				"Topic": "Automated Deployment for .NET with Octopus Deploy",
				"Description": "<p>Do you have an unruly build and deploy process? Find out how to tame it with Octopus Deploy and some related continuous integration / deployment tools.</p>"
			}
		]	
	},
	{
		"Id" : 6,
		"FirstName": "Randy",
		"LastName": "Walker",
		"Bio": "<p>A MicroISV owner for 8 years, Microsoft MVP for 6 years, and former Board member for INETA, Randy Walker has dedicated his life efforts towards fostering the software development community and discipiling young men for Christ.</p>",
		"Website": "",
		"Photo": "/public/img/speakers/randy_walker.jpg",
		"Presentations":[
				{
					"Id" : 1,
					"Track" : "Database",		
					"Topic" : "SQL Scripting",
					"Description" : "<p>Loading from text files using BCP, parsing rows with cursors, temp tables, and crazy sub-queries!</p>"	
				},
				{
					"Id" : 2,
					"Track" : "Web",
					"Topic" : "I’m a Development God and I know it! (Soft skills for the technically skilled)",		
					"Description" : "<p>Let’s face it, geeks rule the world. We’re the smartest, brightest, and some of the richest on the planet. So why do we suck with our people skills? Come find out and discuss how we can help ourselves to become the most successful (and richest) people we deserve to be.</p>"	
				}
		]	
	},
	{
		"Id" : 7,
		"FirstName": "Maya",
		"LastName": "Gaddie",
		"Bio": "<p>I am a Digital Mentor. I work with those who believe what I believe, which is: their diversity and radically different perspectives matter, and that they should be seen and heard. I help them spread their message by figuring out what digital tools are easy for them to use and implement. If we work together in my mentoring group, they design the organized and streamlined business and lifestyle they’ve been dreaming about and free up their time and location to create a life they enjoy.</p> <p>You can also see my professional biography here: <a href=\"http://www.mayagaddie.com/professionalbio\">http://www.mayagaddie.com/professionalbio</a>",
		"Website": "http://www.mayagaddie.com",
		"Photo": "/public/img/speakers/maya_gaddie.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Tech Entrepreneurship",
				"Topic": "How Purpose-Driven Entrepreneurs Can Use Digital Tools To Spread Their Message with Ease",
				"Description": "<p>In this talk I cover why diversity and radically different perspectives matter and how they can be seen and heard.</p><p>I also dive into how you can create organized, streamlined, consistent, remote work to free up time and location (organized with tech) to work on what you’re passionate about and enjoy your life.</p><p>Finally, I do a deep dive and give specific examples on why creating a delightful customer experience is the key to making your purpose and voice matter.</p>"
			}
		]	
	},
	{
		"Id" : 8,
		"FirstName": "David",
		"LastName": "Felio",
		"Bio": "<p>David Felio is a Managing Consultant in the Application Security practice at FishNet Security. During his years in application security, he has conducted scores of application assessments and code reviews. He also delivers application security training classes, threat modeling, architecture reviews, and secure SDLC reviews. David has conducted assessments and training for national and international clients in myriad industries, including retail, healthcare, petroleum, financial services, and government.</p> <p> David has been working in information technology for over 15 years. Prior to joining FishNet Security, David worked for a government contractor, where he led his division’s security efforts. Before realizing he enjoyed breaking applications more than building them, he was a senior developer. David is a PCI QSA and a member of the SANS/GIAC advisory board.</p>",
		"Website": "",
		"Photo": "/public/img/speakers/david_felio.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Web",
				"Topic": "To OWASP and Beyond - Common Application Vulnerabilities",
				"Description": "<p>Application security is talked about more than it is acted on, as evidenced by the vulnerabilities we continue to see every day. In order to highlight these types of vulnerabilities, OWASP (the Open Web Application Security Project) publishes its Top Ten web application vulnerabilities every 3 years. We'll review the current Top Ten list and then discuss other vulnerabilities that aren't included as well as combo attacks (combining multiple vulnerabilities into a finishing move). Along the way, we will laugh and cringe at tales of applications that didn't quite get it right. (Identities of the examples will not be disclosed so as to protect the fails -- and my job.)</p>"
			}
		]	
	}
	,
	{
		"Id" : 9,
		"FirstName": "Michael",
		"LastName": "Perry",
		"Bio": "<p>Software is math. Every class is a theorem. The compiler is the proof. And unit tests check our work.</p> <p>Michael has recorded Pluralsight courses on CQRS, XAML Patterns, and Cryptography, in addition to Provable Code. He maintains the spoon-bending Update Controls and Correspondence open-source libraries. And he helps his clients at Improving Enterprises benefit from the power of software mathematics. You can find out more at qedcode.com.</p>",
		"Website": "http://qedcode.com",
		"Twitter":"michaellperry",
		"Photo": "/public/img/speakers/michael_perry.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Mobile",
				"Topic": "Build Flappy Bird in 50 Minutes",
				"Description": "<p>You have your choice of thousands of Flappy Bird knockoffs on any platform you want. But you can do it better than those guys! Learn how to build Flappy Bird for Android, iOS, and Windows Phone with one common C# code base using MonoGame.</p><p>You will learn how to maximize the code reuse across platforms. You will see how to abstract control structures to work best on the target platform. You will explore physics, game play, and graphics options to make the game as fun -- or frustrating -- as you like.</p><p>Bird's gonna flap. Build your app!</p>"
			},
			{
				"Id" : 2,
				"Track": "Other",
				"Topic": "Modeling Settlers of Catan with Degrees of Freedom",
				"Description": "<p>You probably aren't writing games. But you are writing business rules. Just like the rules of games, business rules are interrelated and complex. We'll practice writing business rules by modeling games.</p><p>In any mathematical model, we identify equations and unknowns. The difference between those two tells us the number of degrees of freedom in the system. Once we know the degrees of freedom, we can identify the independent variables and the dependent variables.</p><p>We'll build mathematical models for three popular games: bowling, Dungeons and Dragons, and Settlers of Catan. We'll write code for each of these models in C# using the Update Controls dependency tracking library. This will give us the skills we need to easily model any business system.</p>"
			}
		]	
	},
	{
		"Id" : 10,
		"FirstName": "Sean",
		"LastName": "Townsend",
		"Bio": "<p>Sean is currently an Android developer with Rockfish Digital. He prefers dark chocolate to milk chocolate and tea over coffee.</p>",
		"Website": "",
		"Photo": "/public/img/speakers/sean_townsend.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Mobile",
				"Topic": "Developing Mobile Games With LibGDX",
				"Description": "<p>Video games are currently among the best selling apps on both the App Store and Google Play. Whilst traditionally writing video games has been the domain of professional studios often with large budgets and publisher support, the barriers to game development have in recent years plummeted. The rise of the indie developer and high-powered mobile devices has seen an explosion in smaller-scale video game development. The smartphone app stores are now the most dynamic and interesting video game platforms in the world.</p><p>This presentation will take participants through an overview of a multi-platform mobile game development framework called LibGDX. Core concepts of video game design will be discussed along with an outline of the technical challenges that face mobile video game developers. Insights into some of the technical solutions that are provided by the framework such as object pooling, texture atlases and pre-allocated arrays will be demonstrated.</p><p>A current game in development (predicted to be 80% completed) will be shown and some of the experiences and ups and downs of developing the game will be shared.</p>"
			}
		]	
	},
	{
		"Id" : 11,
		"FirstName": "Shawn",
		"LastName": "Weisfeld",
		"Bio": "<p>Shawn is passionate about building awesome applications and websites with .NET technologies. He is currently an Application Development Manager for Microsoft based in Austin TX and founder of <a href=\"http://UserGroup.tv\">UserGroup.tv</a>. Read his full bio at <a href=\"http://about.me/shawnweisfeld\">about.me/shawnweisfeld</a></p>",
		"Website": "http://www.UserGroup.tv",
		"Twitter":"shawnweisfeld",
		"Photo": "/public/img/speakers/shawn_weisfeld.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Database",
				"Topic": "Redis",
				"Description": "<p>Redis (http://msopentech.com/opentech-projects/redis) is a very popular open-source, networked, in-memory, key-value data store. It is known for high performance, flexibility, a rich set of data structures, and a simple straightforward API. MS Open Tech has been working with the Redis community to build a production-ready Windows port of Redis, including 64-bit support, an installer for Windows Azure, NuGet support, and much more. In this talk we will discuss what it takes as a .NET Developer to work with Redis both on prem and in the cloud.</p>"
			}
		]	
	},
	{
		"Id" : 12,
		"FirstName": "Bill",
		"LastName": "Hartzer",
		"Bio": "<p>Bill Hartzer is the Senior SEO Strategist at Globe Runner. Bill is a frequent speaker and expert discussion panel participant at various search engine marketing and internet marketing conferences and events such as the Search Engine Strategies and the PubCon conferences. Bill writes frequently for Search Engine Watch, Search Engine Guide, and is regularly published in many online publications. He maintains a blog on his website, www.BillHartzer.com, and is one of the original founders of the Dallas/Fort Worth Search Engine Marketing Association. He has over 18 years of search engine marketing, SEO, and social media marketing experience.</p>",
		"Website": "",
		"Twitter": "bhartzer",
		"Photo": "/public/img/speakers/bill_hartzer.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Web",
				"Topic": "SEO For Web Developers",
				"Description": "<p>As web developers, we know that SEO (Search Engine Optimization) is important when building a website. But what parts of SEO is important, and what parts of on-site SEO can be ignored? In this panel, we'll discuss search engine friendly websites, building sites with 'responsive design' and migrating sites from old an older CMS to WordPress.</p> <p>The focus will be primarily on on-site search engine optimization, and making websites are search engine friendly. We'll also discuss how to perform a search engine optimization audit of your own website, using several widely available tools. Some of the tools discussed will be website crawlers (you can crawl your own website and check for errors and common SEO problems) and using the data provided in Google Webmaster Tools and Bing Webmaster Tools.</p>"
			}
		]	
	},
	{
		"Id" : 13,
		"FirstName": "Jake",
		"LastName": "Truemper",
		"Bio": "<p>Jake is a nimble-minded innovator with a passion for collaboration and user-centered methodologies. He is heavily involved in the St. Louis digital community, and is a regular guest lecturer at colleges, special interest groups and conferences. Jake has led User Experience initiatives for more than 50 companies from over 20 distinct industries. He is currently leading the User Experience team at Manifest Digital in St. Louis.</p>",
		"Website": "",
		"Twitter":"trump29",
		"Photo": "/public/img/speakers/jake_truemper.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Web",
				"Topic": "Dr.* Truemper, or: How I Learned to Stop Being Wasteful and Love Lean UX",
				"Description": "<p>Bloat. Waste. Fatty surplus. Years ago, these ever-present and profit-consuming words pushed Toyota to create a new way of thinking about the manufacturing process. A way that would eliminate waste. A lean way, you might say. Lean UX is the extension of that thinking in the digital world. It’s a process that promises to create quality and efficiency, while eliminating headaches and finger pointing. In this session Jake Truemper (not actually a doctor) will dive in to explain how teams can immediately employ Lean UX techniques to improve workflow.</p>"
			}
		]	
	},
	{
		"Id" : 14,
		"FirstName": "Duncan",
		"LastName": "Jimbo",
		"Bio": "<p>Born and raised in Kenya, Duncan Jimbo is currently a front-end developer based in Saint Louis, Missouri. Curious and creatively motivated, he finds great satisfaction in using new technology to make the web a more delightful place to work and play. In addition to being a programmer and problem-solver, he also loves the teaching and learning opportunities that come from collaboration. Outside of work, Duncan enjoys taking road trips and sharing his latest brew — the finest Kenyan tea this side of the Mississippi.</p>",
		"Website": "",
		"Twitter":"duncanjimbo",
		"Photo": "/public/img/speakers/duncan_jimbo.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Web",
				"Topic": "Think Fast: Getting started with website performance in the age of responsive web design",
				"Description": "<p>Who ultimately should be the steward of website performance? The designers? The developers? Someone else? Of course, the right answer to this critical element of website creation is that it is everyone’s responsibility. Each role and department within an organization (project managers, UX, account managers, designers, developers – and even clients) has a role to play in ensuring the final product delivered to users is as fast, quick and speedy as can be. Not only does this make for better user experiences, but it also ensures we meet our business objectives.</p><p>Making websites fast is a battle I fight daily as we try to maintain the balance between fast, usable and beautiful. Over the past few years, especially with the growth of mobile usage, I've found that it is important to be aware of the consequences of the decisions we make as we create sites, be it design or development, and the biggest step forward is ensuring that we are all aware of these challenges as well as ways that we can counter them. While each project is different from the next, the material in this discussion should serve as a handy guide to making sites faster for everyone involved in making websites</p>"
			}
		]	
	},
	{
		"Id" : 15,
		"FirstName": "Jon",
		"LastName": "Robertson",
		"Bio": "<p>As a software developer using Delphi since 1996, Jon has earned three Delphi certifications and has presented at three Delphi conferences.  He has also contributed to multiple commercial software products, partially through his work at MedEvolve, an ISV developing healthcare software, for the last fourteen years.</p><p>Jon is a DJ at heart and can almost always be found with music playing as his background noise.  He is very excited about exploring new mobile development opportunities using Delphi.</p>",
		"Website": "",
		"Photo": "/public/img/speakers/jon_robertson.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Mobile",
				"Topic": "Cross platform mobile development with Delphi",
				"Description": "<p>With Delphi XE 6, you can develop an application that can run on Windows, Mac OS X, iOS, and Android. All from a single IDE. In this session, I'll give an introduction to using Delphi XE 6 to do just that. For each platform, I'll demonstrate how to build, deploy, and debug a sample application.</p>"
			}
		]	
	},
	{
		"Id" : 16,
		"FirstName": "Paul",
		"LastName": "Hacker",
		"Bio": "<p>Paul Hacker has over 10 years of application architecture, design, development, and management expertise in Microsoft technologies. His strong technical aptitude, excellent communication skills, and dedicated work ethic have enabled him to drive and deliver successful projects and solutions to clients.Paul has a depth of experience in ALM, Process Improvement, and Team Foundation Server. Having distinguished himself as a leader in the IT industry he has been awarded the distinction of Microsoft MVP in the ALM category every year since 2006. Prior to 2006 Paul carried the Microsoft MVP distinction in the C# category consistently from 2002 to 2005.Over the years Paul has proven his expertise in Application Lifecycle Management and has demonstrated his professionalism and commitment to the continuous process of managing the life of an application through governance, development and maintenance.</p>",
		"Website": "",
		"Twitter":"pjhacker",
		"Photo": "/public/img/speakers/paul_hacker.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Other",
				"Topic": "What's New for ALM in Visual Studio 2013 and Team Foundation Server 2013",
				"Description": "<p>The latest versions of Visual Studio and TFS bring some great new features for developers, Product Owners, testers, and even the crusty old stakeholders. More than ever, TFS integrates the whole ALM story to help you deliver your project on time and on budget. In this session, we'll quickly recap the best features of TFS 2012 and then look at the great new features in TFS 2013. Paul will show you the new ALM features that make TFS perfect for Product Owners and company Stakeholders. He will also show you how developers work with TFS more effectively than ever, right from Visual Studio. We will finish off with the awesome story for testers.</p>"
			},
			{
				"Id" : 2,
				"Track": "Other",
				"Topic": "Define you Release Pipeline with Release Management 2013",
				"Description": "<p>Are you looking for a way to track your release process and start automating your deployments for repeatable success? Are you wanting to have automation that is the same across development, test, and even production environments? If so, come and learn about release management tooling. Microsoft recently acquired InRelease from InCycle Software which is now the release management components being integrated into Team Foundation Server. In this session, we will explore this new technology set and what it means for your team in the Visual Studio 2013 and Team Foundation Server 2013 release</p>"
			}
		]	
	},
	{
		"Id" : 17,
		"FirstName": "Angie",
		"LastName": "Albright",
		"Bio": "<p>Angie Albright is the Director of Programs for the Arkansas Nonprofit Alliance. She has many years of experience in online instructional design, and more recently has become a passionate advocate for the use of technology to support nonprofit organizations' needs. She loves to do crazy things like develop technology strategic plans, fool around on the back side of websites, sit on boards of directors for organizations whose missions she's passionate about, and learn new technologies that contribute to the social good. </p>",
		"Website": "http://www.angiemalloyalbright.com",
		"Twitter":"AngieAlbright",
		"Photo": "/public/img/speakers/angie_albright.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "IT Professional",
				"Topic": "IT Where You Least Expect It",
				"Description": "<p>Basic knowledge of software and web development is becoming a must in industries where people might least expect it. This panel will address several faces of IT in the areas of law, nonprofit management, education, and software product management.</p><p>Angie Albright: Nonprofit organizations are catching up to the commercial world in their use of web design and development, software, and CRMs. Their ability to manage programs, raise money, and communicate effectively with their supporters and the community relies on these technologies. A whole new market for developers and IT specialists are opening up in the field of nonprofit technology education and services.</p><p>Meredith Lowery: IT in the legal arena has developed leaps and bounds with new developments in software, data management, and within the courts and bureaucratic offices in the government. Added to that, the legal arena also provides protections for IT through the patent arena.</p><p>Sarah Daigle: Educators and parents are taking a deep dive into the IT sphere through their kids and schools. Smart phones, Minecraft, tablets and streaming everything have upped the ante for technology in the home. The industry needs technologists of all flavors from hard-core gear heads to gentle email marketing gurus.</p>"
			}
		]	
	},
	{
		"Id" : 18,
		"FirstName": "Meredith",
		"LastName": "Lowry",
		"Bio": "<p>Meredith is a partner and registered patent attorney with Smith Hurst. She is a native of Northwest Arkansas with substantial experience in all aspects of intellectual property law. Meredith’s practice principally involves various aspects of intellectual property, including patent litigation, trademark litigation, and computer technology. Since 2005, she has assisted a variety of inventors from individual entrepreneurs to large companies in their efforts to obtain patent, trademark and copyright protection and has also worked with such clients to protect those assets and defend against allegations of infringement. A meaningful amount of her practice is devoted to the transfer and licensing of rights of intellectual property, including technology transfer agreements and due diligence, as well as in trademark prosecution and patent prosecution.</p>",
		"Website": "http://www.smithhurst.com",
		"Twitter":"MeredithLowry",
		"Photo": "/public/img/speakers/meredith_lowry.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "IT Professional",
				"Topic": "IT Where You Least Expect It",
				"Description": "<p>Basic knowledge of software and web development is becoming a must in industries where people might least expect it. This panel will address several faces of IT in the areas of law, nonprofit management, education, and software product management.</p><p>Angie Albright: Nonprofit organizations are catching up to the commercial world in their use of web design and development, software, and CRMs. Their ability to manage programs, raise money, and communicate effectively with their supporters and the community relies on these technologies. A whole new market for developers and IT specialists are opening up in the field of nonprofit technology education and services.</p><p>Meredith Lowery: IT in the legal arena has developed leaps and bounds with new developments in software, data management, and within the courts and bureaucratic offices in the government. Added to that, the legal arena also provides protections for IT through the patent arena.</p><p>Sarah Daigle: Educators and parents are taking a deep dive into the IT sphere through their kids and schools. Smart phones, Minecraft, tablets and streaming everything have upped the ante for technology in the home. The industry needs technologists of all flavors from hard-core gear heads to gentle email marketing gurus.</p>"
			}
		]	
	},
	{
		"Id" : 19,
		"FirstName": "Adam",
		"LastName": "Hill",
		"Bio": "<p>Adam Hill is a Consultant for Improving Enterprises in Addison Texas. He knew he wanted to be a programmer when he was 10 years old and never looked back.</p><p>Adam is involved in many user groups in DFW and puts on the local Global Game Jam at Collin College, a crazy, worldwide race to make a game in 72.</p> <p>On the weekends you can find him gaming, making weird food and oh yeah… programming.</p>",
		"Website": "",
		"Twitter":"adamhill",
		"Photo": "/public/img/speakers/adam_hill.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Other",
				"Topic": "DEPLOY ALL THE GAMES!!!",
				"Description": "<p>Come see how you can use Unity3D toolset to build and deploy your game to ALL THE DEVICES!. New devices do not need ports from scratch anymore, its the 21st Century.</p><p>We will explore how to deal with differing form factors, pixel densities, graphics support, input systems and other multi platform madness.</p><p>It can be done. It’s not too hard.</p>"
			}
		]	
	},
	{
		"Id" : 20,
		"FirstName": "Nancy",
		"LastName": "Knighten",
		"Bio": "<p>Nancy Knighten has worked for the Arkansas Small Business and Technology Development Center at the University of Arkansas at Little Rock for six years in economic development. She provides management and technical advice to current and potential small business owners and assists clients in solving business problems and advancing their companies. Business planning, marketing strategy development, and loan packaging are some of her specialities.</p>",
		"Website": "http://asbtdc.org",
		"Twitter":"",
		"Photo": "/public/img/speakers/nancy_knighten.jpg",
		"Presentations":[
			{
				"Id" : 1,
				"Track": "Tech Entrepreneurship",
				"Topic": "Designing Your Business Venture",
				"Description": "<p>You’ve got tech, now what? This is an informational session about evaluating the next steps in the dynamic planning and development process for your technology as a business venture. The session will take a look at business modeling and how to monetize and bring your technology to the masses. Think brainstorming with a little lagniappe!</p>"
			}
		]	
	}	
]