
[
  {
    "Id": 592,
    "FirstName": "Lisa",
    "LastName": "Huang",
    "Bio": "Lisa Huang is a co-founder of FlightGold, a Fullstack engineer based in San Francisco Bay area. Lisa has a background in digital marketing, building mobile-optimized web apps and a keen Rubyist. She is a self-taught developer and started her coding journey with FreeCodeCamp projects. <br/><br/>In her off time, you can find Lisa exploring the West coast and hacking on Arduino.<br/>",
    "Website": "http://lambdalisa.com/",
    "Twitter": "lisaychuang",
    "Photo": "img/speakers/huang-lisa.jpg",
    "Company": "FlightGold, inc",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 5,
        "Track": null,
        "Day": 1,
        "Room": "2",
        "SessionNumber": 6,
        "Topic": "Instant Mobile Web: An Accelerated Mobile Pages primer",
        "Description": "In Oct 2016, mobile and tablet internet usage exceeded desktop for the first time worldwide! With **over 50% of your users on their phones**, is your web app optimised for them?<br/><br/>[Accelerated Mobile Pages (AMP)](https://www.ampproject.org/) is an open-source initiative, a Javascript library for building **lightening speed mobile web apps**. As of May 2017, there are over 2billion AMP pages and growing! The Washington Post, eBay, Airbnb - these are just some companies who are using AMP in their web products<br/><br/>We will look under the hood and learn about how **AMP optimizes mobile web performance** with resource allocation, invisible ink, sandbox iFrames and more. Attendees will learn about what makes AMP pages lightning fast on mobile, and get up and running with a **code demo.**<br/><br/>Attendees will learn first hand about: <br/><br/>1. How AMP addresses mobile user pains <br/>2. How to build a valid AMP page with navigation, embedded media, and user interactivity. <br/>3. Future AMP integration with progressive web apps (PWA)<br/><br/>This talk is suitable for beginner and intermediate developers with experience in Javascript. [Click here for Presentation slides](bit.ly/AMPCorgi)",
        "SlidesLink": "http://bit.ly/LRTF-AMP"
      }
    ]
  },
  {
    "Id": 594,
    "FirstName": "Don",
    "LastName": "Schenck",
    "Bio": "A developer who has seen it all, Don is a Microsoft MVP and currently a Director of Developer Experience at Red Hat, with a focus on Microsoft .NET on Linux. His mission is to connect .NET developers with the Linux and open source communities. Prior to Red Hat, Don was a Developer Advocate at Rackspace where he was immersed in cloud technology. He still enjoys cooking and studying human behavior, and still hates the designated hitter rule.<br/> <br/>Don's overarching belief is this: \"A program is not a communication between a developer and a machine; it's a communication between a developer and the next developer.\"",
    "Website": "http://redhatloves.net",
    "Twitter": "DonSchenck",
    "Photo": "img/speakers/schenck-don.jpg",
    "Company": "Red Hat",
    "LinkedIn": null,
    "Presentations": [
      {
        "Id": 28,
        "Track": null,
        "Day": 2,
        "Room": "3",
        "SessionNumber": 5,
        "Topic": "Creating Bots with the Microsoft Bot Framework",
        "Description": "Every wonder how a bot works? How it carries on a conversation, or helps you book a hotel room?<br/> <br/>The Microsoft Bot Framework is not just about Skype. You can build bots for Skype, Facebook, Slack, SMS and much more. You can leverage your existing C# skills and create interactive bots that can assist users.<br/> <br/>In this session you will see a bot created in real time, as well as learn about the considerations for building a useful and successful bot.<br/>",
        "SlidesLink": null
      },
      {
        "Id": 69,
        "Track": null,
        "Day": 1,
        "Room": "3",
        "SessionNumber": 3,
        "Topic": ".NET, Linux and Microservices Architecture",
        "Description": "Microsoft’s move to make .NET open source could not have come at a better time. As the world explores and moves to Microservices Architecture (MSA) and Linux containers, .NET stands poised to not only join the fray, but to excel with high-performance services.<br/><br/>In this fast-paced session, you will see .NET code (C# and F#) be turned into microservices, running in Red Hat’s OpenShift PaaS. Linux, .NET, docker, kubernetes and MSA will all be tied together in this peek into the future. To finish up, we’ll demonstrate two deployment methods: Blue/Green and Canary, and show how uninterrupted deployments are possible.",
        "SlidesLink": null
      }
    ]
  }
]
