[
	{
		"logo": "/img/sponsors/lafferty.png",
		"datePosted": "5/25/2018",
		"posTitle": "Software Developer (Laravel)",
		"located": "North Little Rock",
		"posType": "Full Time",
		"posDesc": "We benefit more and more from our custom software packages, and are looking for a Software Developer (Laravel) to help accelerate their positive effects. Our ideal candidate has a solid understanding of full stack web development (e.g. LAMP or MEAN), Laravel, and Git.\n\nWhat would you do?\n\n* Build and support a variety of web applications and commerce systems\n* Enable the internationalization of product literature and web content\n* Extend, implement, and document API endpoints\n* Be flexible, work hard, have fun\n\nWhat's in it for you?\n\n* Two weeks paid vacation each year after one full year\n* Paid Blue Cross/Blue Shield Health insurance for you and your family\n* Available vision, dental, life, etc.\n* 401(k) available, after one full year; Lafferty will contribute 3%\n* Monday to Friday, 8 to 5 office hours\n* A chance to make a big difference in a growing company",
		"appLink": "mailto:curtis@laffertyequipment.com",
		"orgName": "Lafferty Equipment Manufacturing, Inc.",
		"orgDesc": "Lafferty Equipment is known internationally as manufacturers of the best equipment for industrial cleaning and sanitization. We have a great team with talented professionals in all kinds of positions who manage our IT, website, development, translations, and so much more. We strongly value working with talented people and using the best tools for the job.",
		"Your Name": "Curtis Weeks",
		"Your Email": "curtis@laffertyequipment.com",
		"Your Phone": "501-734-0009"
	},
	{
		"logo": "/img/sponsors/apptegy.png",
		"datePosted": "8/14/2018",
		"posTitle": "Front-End Developer",
		"located": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "We are looking for developers who have experience building interactive websites, keeping UI/UX in mind from the very beginning. In a fast-paced startup environment like this, you will be pushing code regularly and seeing the results of your work on a daily basis.",
		"appLink": "http://careers.apptegy.com/apply/jjjj7TySXD/FrontEnd-Developer",
		"orgName": "Apptegy",
		"orgDesc": "Apptegy is an education technology company based in Little Rock, Arkansas. We work to help school districts build a powerful brand without adding more work to their teams. Our publishing platform, Thrillshare, makes it easy for schools to share positive stories with their communities, so they can build their brand around student success.",
		"Your Name": "Tyler Vawser",
		"Your Email": "tyler.vawser@apptegy.com",
		"Your Phone": "6463600737"
	},
	{
		"logo": "/img/sponsors/euronet-software-logo.png",
		"datePosted": "8/14/2018",
		"posTitle": "Software Solutions Architect",
		"located": "Little Rock, AR ",
		"posType": "Full Time",
		"posDesc": "Interested in innovating from the ground up in a global, market leading company? We are developing products to support our existing clients while expanding into new sectors for financial services transformation. As an integral part of an agile, diverse, close-knit development team, you will create world-class applications. You will have the opportunity to work with a range of technologies and platforms, and to contribute to all phases of development. We offer a highly collaborative, fast-paced environment where you can leverage your expertise to help establish new industry standards. Our ideal candidate has a passion for knowledge, a hunger to take on challenging and exciting projects, as well as an unrelenting drive to learn and teach others.\n \n \nThis job might be for you if you:\n*     Want to be responsible for the architecture, development and support of a mission-critical solution and other enterprise applications using the latest architecture patterns. \n*     Can work independently on projects, as well as lead technical teams on projects while collaborating with peers and other technology teams.\n*     Able to understand individual components in the context of the overall solution and design/code within that understanding. \n*     Enjoy contributing to solutions servicing a global market in a rapidly-evolving and fast-paced payments industry. \n*     Desire to influence technology decisions utilizing your skills and passion to investigate emerging technologies and provide recommendations on when to adopt.\n \nWhat you will be doing:\n*     Architecting a payment solution aligned with senior leadership strategic direction.\n*     Leading team?s efforts to deliver design docs that ensure requirements from business sponsors are met while ensuring conforming to   architectural patterns.\n*     Assist in setting processes and standards that align with industry best practices.\n*     Provide leadership in architecting new services within the solution.\n*     Perform code reviews to ensure coding and architectural standards are being met.\n   Serve as escalation point with issue tracking and resolution.\n \nWhat you will need for this position:\n*     At least 3 years of experience architecting enterprise solutions.\n*     Up to 5-10 years of experience in Software Development.\n*     Programming experience with the following: Java, C++, and SQL. \n*     Experience with Java or C++ memory management and performance analysis.\n*     Strong analytical and problem-solving skills.\n*     Excellent communication skills.\n*     Ability to multi-task and manage priorities in a team environment.\n*     Strong leadership skills.\n*     Ability to travel internationally on a limited basis.\n \nAdded skills we value:\n*     Banking or Payments industry experience.\n*     Programming experience with Vue and or JavaScript.\n*     Experience with REST, JSON, Microservices, SOA, Docker or Containers.\n*     Experience with database design and database performance optimizations.\n \nWhat's in it for you:\nQuite simply, the work. Meaningful work that makes people?s lives all over the world a little easier. At Euronet, we offer financial payment convenience to millions of individuals who may have never had access to such advantages before?and we do so with honesty, transparency and integrity. As we have evolved, we have remained true to those core beliefs, while using technology to create more and more connections, which allow our customers and end consumers even more flexibility and affordability. \n \nWe also offer a generous benefit package, employee stock purchase plan, tuition reimbursement, casual dress and a stable work environment. In other words, you get all the benefits that come with a working for a well-established company and all the excitement of a startup with our new product development. \n \nEuronet USA, LLC, headquartered in Little Rock, Arkansas, is a wholly owned subsidiary of Euronet Worldwide, Inc., a U.S.-based company. Listed on NASDAQ as EEFT, Euronet has market capitalization of over $4 billion USD.\n ",
		"appLink": "\thttp://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ952079813&rpid=46914&webapp=1",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "",
		"Your Name": "Aaron Quint",
		"Your Email": "aquint@euronetworldwide.com",
		"Your Phone": "9133274156"
	},
	{
		"logo": "/img/sponsors/euronet-software-logo.png",
		"datePosted": "8/14/2018",
		"posTitle": "Software Development Manager",
		"located": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "Interested in innovating from the ground up in a global, market leading company? We are developing products to support our existing clients while expanding into new sectors for financial services transformation. As an integral part of an agile, diverse, close-knit development team, you will create world-class applications. You will have the opportunity to work with a range of technologies and platforms, and to contribute to all phases of development. We offer a highly collaborative, fast-paced environment where you can leverage your expertise to help establish new industry standards. Our ideal candidate has a passion for knowledge, a hunger to take on challenging and exciting projects, as well as an unrelenting drive to learn and teach others.\n \n \nThis job might be for you if you:\n*     Want to be responsible for the architecture, development and support of a mission-critical solution and other enterprise applications using the latest architecture patterns. \n*     Can lead technical teams on projects while collaborating with peers and other technology teams.\n*     Able to understand individual components in the context of overseeing the overall solution and lead design/code within that understanding. \n*     Enjoy contributing to solutions servicing a global market in a rapidly-evolving and fast-paced payments industry. \n*     Desire to influence technology decisions utilizing your skills and passion to investigate emerging technologies and provide recommendations on when to adopt.\n \nWhat you will be doing:\n*     Provide strategic leadership and direct management of a development team including architects and developers, both local and international \n*     Resource planning, scheduling, and tracking of application development projects.\n*     Strong participation in setting software development processes and best practices and enforcing same.\n*     Facilitate daily stand ups with team members. \n*     Solution/Product/Application design based on dynamic requirements gathering and business analysis.\n*     Interaction with internal Euronet operations functional units across the globe to define/refine feature/functionality of the applications.\n*     Support installation teams and provide second-level maintenance support for production deployed applications/solutions.\n*     Collaborating with internal and external customers.   \n*     Function as a liaison between the development team and the other departments including periodic updates on key projects and weekly prioritization meetings. \n \nWhat you will need for this position:\n*     At least 5 years leading and managing development teams\n*     At least 3 years of experience architecting enterprise solutions.\n*     Up to 5-10 years of experience in Software Development.\n*     Programming experience with the following: Java, C++, and SQL. \n*     Strong leadership skills and collaborative approach across business.\n*     Demonstrated ability to lead projects and teams to on time completion with high quality.\n*     Excellent communication skills ? both verbal and written.\n*     Ability to multi-task and manage priorities in a team environment.\n*     Strong analytical and problem-solving skills.\n*     Ability to travel internationally on a limited basis.\n \nAdded skills we value:\n*     Banking or Payments industry experience.\n*     Programming experience with Vue and or JavaScript.\n*     Experience with database design. \n*     Experience with REST, JSON, Microservices, SOA, Docker or Containers.\n*     Experience with database design and database performance optimizations.\n*     Degree in Management or Business-related fields.\n*     Degree in Computer Science or Information Technology.\n*     Experience interacting with international, remote software developers.",
		"appLink": "\thttp://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ735488725&rpid=46316&webapp=1",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "",
		"Your Name": "Aaron Quint",
		"Your Email": "aquint@euronetworldwide.com",
		"Your Phone": "9133274156"
	},
	{
		"logo": "/img/sponsors/euronet-software-logo.png",
		"datePosted": "8/14/2018",
		"posTitle": "Software Developer",
		"located": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "We are on the hunt for a confident, self-managing Software Developer. We are looking for highly competitive individual with a ?win today? mindset that is wired with a team-first attitude. As part of our development team, you will be responsible for contributing to the success of our mission in all channels and the execution of our strategic mission.\n \n \nThis job might be for you if you:\n*     Want to be responsible for the design, development and support of a mission-critical processing platform and other enterprise applications.\n*     Can work independently on projects as well collaborating with peers and other technology teams while adapting to changes and taking responsibility in a fast-paced organization.\n*     Enjoy contributing to solutions servicing a global market in a rapidly-evolving and fast-paced payments industry.\n \nWhat you will be doing:\n*     Designing, coding, and testing of enterprise application solutions utilizing RPG, RPG IV, RPG Free.\n*     Modifying existing programs to resolve problems, add functionality or support client-specific environments.\n*     Second line support of production and implementation teams.\n*     Performs other duties as assigned.\n \nWhat you will need for this position:\n*     Bachelor?s degree in Computer Science or related field.\n*     1-3 years of experience in software development and design. \n*     Proficiency in Computer Science fundamentals ? algorithms, design, problem solving, debugging, and complexity analysis.\n*     Experience working with relational databases.\n*     Problem-solving skills.\n*     Communication skills.\n*     Self-discipline for planning and organizing tasks.\n*     Willingness to learn RPG, RPG IV, RPG Free programming language.\n \nAdditional skills we value:\n*     Banking or Payments industry knowledge\n*     Knowledge of IBM iSeries\n*     Rational Software experience\n*     Experience with SQL\n \nWhat's in it for you:\nQuite simply, the work. Meaningful work that makes people?s lives all over the world a little easier.  At Euronet, we offer financial payment convenience to millions of individuals who may have never had access to such advantages before?and we do so with honesty, transparency and integrity. As we have evolved, we have remained true to those core beliefs, while using technology to create more and more connections, which allow our customers and end consumers even more flexibility and affordability. \nWe also offer a generous benefit package, employee stock purchase plan, tuition reimbursement, casual dress and a stable work environment. In other words, you get all the benefits that come with a working for a well-established company and all the excitement of a startup with our new product development. \n \nEuronet USA, LLC, headquartered in Little Rock, Arkansas, is a wholly owned subsidiary of Euronet Worldwide, Inc., a U.S. based company. Listed on NASDAQ as EEFT, Euronet has market capitalization of over $4 billion USD.\n ",
		"appLink": "\thttp://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ837822724&rpid=46242&webapp=1",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "",
		"Your Name": "Aaron Quint",
		"Your Email": "aquint@euronetworldwide.com",
		"Your Phone": "913-327-4156"
	},
	{
		"logo": "/img/sponsors/first-orion.png",
		"datePosted": "8/14/2018",
		"posTitle": " Senior Mobile Software Developer/Android",
		"located": "Little Rock, Arkansas ",
		"posType": "Full Time",
		"posDesc": "\nWe are seeking a talented engineer to join a leading mobile software vendor in the User Experience Architecture Group. This business group is responsible for providing all the mobile software on users? handsets and the back-end parts of the SOA-based data solutions and services, enabling the mobile application to communicate with the various carrier network services, backend data providers and workflows. The engineer will design, develop and maintain Android-based solutions, work directly with OEMs on the latest software and firmware and ensure high level of user satisfaction by creating a great user experience with the mobile application. \n\nJob Responsibilities: \n\n*Develop innovative and user-friendly user interface and help enhance user experience for the PrivacyStar suite of applications\n*Help identify, fix or improve current solutions using cutting edge mobile technologies and Android OS facilities and frameworks\n*Work with the rest of the development team to ensure the best end-to-end user experience\n*Help define the future of PrivacyStar applications by building innovative approaches to business problems on mobile devices\n*Work with the backend development team to ensure the most efficient use of the backend APIs as well as help shape the new lightweight APIs and Web *Services to work with the Android UX and Material Design concepts\n*Participate in Continuous Integration, Code Coverage and Google Play Store release process, as well as other parts of the Application Development Lifecycle to ensure high quality and agility of the software development process\n\nRequired Skills:\n\n*Strong working knowledge of Java, C++ or Kotlin. If you know some other OOP language, that?s a plus\n*Software development and debugging skills\n*Experience developing user-facing applications and knowledge of the Google's *Material Design concepts\n*Current industry experience with app development on Android\n*Experience delivering finished Android applications to the Google Play Store for consumer or internal company use\n*Ability to create engaging user interfaces and knowledge of usability principles\n*Knowledge of basic networking principles behind World Wide Web. Most of our products are web-connected\n\nNice To Have Skills:\n\n*Knowledge of developing with HTML5/CSS/JavaScript\n*Experience in graphics manipulation or design\n*Strong interpersonal and communication skills\n\nIf You Are A Match:\n\nWe?ll make sure to give you plenty of opportunities to learn new technologies and acquire new skills. You?ll be able to get a first-hand experience of what other customers think about your product?no filters applied. You?ll get to learn about mobile telephony and work directly with OEMs making the mobile handsets, carriers providing the service and other partners we have?all working together to deliver a solution to the consumers. You?ll see real-time statistics and know the impact your work is making on the company and its future. You?ll work with very experienced and capable leaders.\n\nCompany Benefits:\n\nAt First Orion we offer a competitive salary, full benefit package including matching 401(k) and an open paid time off policy. Our work environment is energetic, focused, fun, and collaborative. We?ve created a special culture where trust and transparency are key and employees are empowered to make their own decisions. Our people are passionate about what we do and have an indomitable spirit to get things done. Everyone is a part of the big picture here.\n\nFirst Orion Voted Great Place to Work US with Top Rankings in every category! Check out the full spread here: http://ow.ly/a731303vHps.\n\nFirst Orion is an Affirmative Action and Equal Opportunity Employer. Apply today!",
		"appLink": "https://grnh.se/27f8e9ad1",
		"orgName": "First Orion",
		"orgDesc": "First Orion is an industry-leading call protection/transparency and data provider, developing software and services to enable our customers to take complete control over their telecommunications, powered by world-class data and technology solutions. Our applications and in-network services provide call and text blocking, spam and robocall tagging/blocking, caller identification, caller categorization, directory assistance and complaint filing with regulatory agencies in US and abroad. With our customers help we have tagged and/or blocked over 2.5 billion calls in the past 12 months and our users file over 50,000 complaints monthly against offending callers directly to federal agencies. First Orion provides solutions to some of the largest mobile service providers in the world and features leading brands in the communication industry including PrivacyStar and Accudata with offices in Washington, Arkansas, and London, England.   ",
		"Your Name": "Allison Nicholas",
		"Your Email": "anicholas@firstorion.com",
		"Your Phone": "501.269.4119"
	},
	{
		"logo": "/img/sponsors/euronet-software-logo.png",
		"datePosted": "8/14/2018",
		"posTitle": "Software Architect  ",
		"located": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "We are on the hunt for a confident, self-managing Software Architect. We are looking for highly competitive individual with a ?win today? mindset that is wired with a team-first attitude. As part of our development team, you will be responsible for contributing to the success of our mission in all channels and the execution of our strategic mission.\n \nWhat you will be doing:\n*     Analyze and improve existing traditional IBM iSeries applications by improving the functionality and design.\n*     Participating in design and code reviews. Coordinate planning and design of new systems to maximize reuse of applications/components, application patterns and adherence to technology standards.\n*     Troubleshoot routine application/product issues (Incident Tracking and Resolution) opened by internal and external customers.\n*     Perform work of medium to high difficulty in designing, writing, editing, modifying, and debugging computer programs.\n*     Participates in development activities to continually learn more about technology and development.\n*     Performs other related duties as assigned.\n \nWhat you will need for this position:\n*     7-10+ years of experience in Software Development, Design, and System Integration.\n*     BS in Computer Science, or 7+ years of programming/designing experience including CLE, DDS SDA, CMD and Sub-file processing.\n*     Programming experience with SQL.\n*     RPG ILE using free format and sub procs.\n*     Problem solving skills.\n*     Teamwork and excellent communication skills.\n*     Ability to work independently and without significant supervision\n*     Must possess a service-oriented attitude and be able to communicate and coordinate well with team members and customers. \n \n\nPreferred Skills:\n*     Knowledge of IBM iSeries.\n*     Programming experience with RPG ILE and RPG Free.\n*     Rational Software experience.\n*     Experience with Financial Transaction processing systems.\n \nWhat's in it for you:\nWe offer a generous benefit package including Medical, Dental, Vision, Life Insurance, Flexible Spending Account, Health Savings Account, 401K, Employee Stock Purchase Plan, Education Reimbursement as well as an exciting, evolving work environment!\n ",
		"appLink": "http://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ40571166&rpid=44755&webapp=1",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "",
		"Your Name": "Aaron Quint",
		"Your Email": "aquint@euronetworldwide.com",
		"Your Phone": "9133274156"
	},
	{
		"logo": "/img/sponsors/euronet-software-logo.png",
		"datePosted": "8/14/2018",
		"posTitle": "Programmer Analyst / Senior Programmer Analyst",
		"located": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "This job might be for you if you:\nAre interested in providing second-line software application support and product modifications that involve functions such as coding, debugging and system testing for customer inquiries and point release upgrades.  \n \nWhat you will be doing:\n*     Provide software application second line support for customers issues and point release upgrade projects.\n*     Develop programs that meet the expected results and specifications established by Euronet standards. This includes reading program code to identify source of problem, coding a complete program or modifying an existing program.\n*     Set parameters, checking system flow, identify and solve problems to configure a system in response to customer issues, request or point release upgrade.\n*     Deliver training to employees or customers to enable them to properly accomplish their duties and responsibilities using Euronet products.\n*     Collect and analyze information from customer to define the nature and cause of problems and to develop steps needed for solution.\n*     Test programs or systems using data or transactions which represent conditions which will occur in actual use and verify the accuracy of results.\n*     Provide support for manager or department by composing correspondence, gathering requested information, and other administrative task.\n*     Coordinate with other employees or customers to accomplish specific objectives and results.\n*     Manipulate out queues and print reports, manipulate data, manage job queues, troubleshoot and perform general operations related to the AS/400 or iSeries.\n \nWhat you will need for this position:\n*     Bachelor?s Degree in Computer Science, Business, Accounting or a related academic field or 5 years comparable experience in either a banking environment, a programming environment or a technical services oriented environment. \n*     At least 5 years? experience in Euronet software products. \n*     At least 5 years of experience in the AS/400 or iSeries platform and OS/400 operating system. \n*     At least 5 years? experience in computer programming in CL, RPG, RPGLE or Java/SQL. \n*     At least 5-year experience in the banking background in card services, ATM processes, such as balancing, reporting and error resolution with a comprehension of the ?daily cycle? transactions.\n*     At least 5 years? experience in Card Processing, including debit and credit card and /or electronic financial transaction. \n*     Strong communication, listening and client service skills.\n*     Ability to work and interact within a team environment as well as in a standalone environment.\n*      Ability to multi- task, plan manage priorities and work independently without significant supervision.\n*     Ability to perform Administrative functions.\n*     Knowledge of a PC platform with a Windows operating system ",
		"appLink": "\thttp://www.euronetworldwide.com/corporate/careers.cfm?cjobid=AQ20158110&rpid=46115&webapp=1",
		"orgName": "Euronet Software Solutions",
		"orgDesc": "",
		"Your Name": "Aaron Quint",
		"Your Email": "aquint@euronetworldwide.com",
		"Your Phone": "9133274156"
	},
	{
		"logo": "/img/sponsors/first-orion.png",
		"datePosted": "8/14/2018",
		"posTitle": "Quality Assurance Engineer",
		"located": "Little Rock, Arkansas",
		"posType": "Full Time",
		"posDesc": "First Orion is looking for a talented, self-starter, agile and motivated Quality Assurance Engineer to join our team. The ideal candidate will have hands-on experience with mobile (Android & iOS), web and backend testing and QA tools.  You will need to be able to work in an agile development process, execute software testing (in-house, functional and device farm testing), troubleshoot bugs, create/track defects and work closely with developers and product managers to resolve issues.  Specific responsibilities will be to own the testing process which includes full end-to-end testing, writing test scenarios and cases, troubleshooting problems, creating and tracking defects, and related data.\n\nThe Quality Assurance Engineer will also complete the following responsibilities:\n\n*Evaluate client use-cases to ensure features and functionality are working to meet client needs\n*Develop test plans, scenarios and test cases for functional, regression and system level test activities for mobile platforms\n*Develop, execute and automate QA tasks for mobile apps on iOS and Android\n*Test user interactions and usability of the application to identify bugs and usability issues\n*Work closely with the cross functional team to quickly isolate, record and report issues\n*Participate in sprint and release planning to understand the requirements and ensure high quality and a great user experience\n*Perform field/road testing\n*Identify and communicate defects and risks\n*Communicate test progress, test results, and other relevant information to project stakeholders\n*Bug life cycle management ? defect tracking, defect reporting, defects analysis and defect verification\n\nRequired Skills:\n\n*Bachelor?s Degree in Computer Science, Technology or related field\n*2+ years of hands on experience in testing mobile apps\n*Experience with web services testing, specifically REST API\n*Android Mobile app testing on mobile phones experience\n*iOS Mobile app testing on mobile phones\n*Good understanding of defect tracking tools such as JIRA\n*Proficient in languages such as Java and C#\n*Strong analytical and troubleshooting skills\n*Experience of working in Agile, Scrum methodology\n*Great team player in a fast-paced, dynamic environment\n*Great sense of time and priority management\n\nCompany Benefits:\n\nAt First Orion we offer a competitive salary, full benefit package including matching 401(k) and an open paid time off policy. Our work environment is energetic, focused, fun, and collaborative. We?ve created a special culture where trust and transparency are key and employees are empowered to make their own decisions. Our people are passionate about what we do and have an indomitable spirit to get things done. Everyone is a part of the big picture here.\n\nFirst Orion Voted Great Place to Work US with Top Rankings in every category! Check out the full spread here: http://ow.ly/a731303vHps\n\nFirst Orion is an Affirmative Action and Equal Opportunity Employer. Apply today!\n\n",
		"appLink": "https://grnh.se/117b8fe61",
		"orgName": "First Orion",
		"orgDesc": "First Orion is an industry-leading call protection and data provider, developing software and services to enable our customers to take complete control over their telecommunications, powered by world-class data and technology solutions. Our applications and in-network services provide call and text blocking, spam and robocall blocking, caller identification, directory assistance and complaint filing with regulatory agencies in US and abroad. With our help, customers have blocked over 200 million numbers and continue to file over 300,000 complaints monthly against offending callers directly to federal agencies. First Orion provides solutions to some of the largest mobile service process in the world and features leading brands in the communication industry including PrivacyStar with offices in Washington, Arkansas and London, England.  ",
		"Your Name": "Allison Nicholas",
		"Your Email": "anicholas@firstorion.com ",
		"Your Phone": "501.269.4119"
	},
	{
		"logo": "/img/sponsors/first-orion.png",
		"datePosted": "8/14/2018",
		"posTitle": " Software Engineer - Data",
		"located": "Little Rock, Arkansas",
		"posType": "Full Time",
		"posDesc": "First Orion is seeking a talented Software Engineer to join our collaborative, fast-paced First Orion Data Products team.  This team leverages our world-class data processing platform to provide businesses with identity verification solutions that help companies recognize legitimate customers, detect fraudulent transactions and actors, and improve business performance.  At the core of our services are our world-class data assets that businesses use to mitigate risk, gain real-time insight into business and customer threats, and improve overall customer experience. \n\nCore Responsibilities:\n\n*Help design, implement and test software features for First Orion?s data analytics infrastructure\n*Contribute to advancing the reliability and performance of the data architecture; introduce new performance metrics and instrumentation points\n*Collaborate with Data Scientists to implement advanced analytics algorithms in distributed big-data environments of scale\n*Participate in the provisioning, deployment, and management of First Orion data products and services in the cloud\n\nRequired Skills:\n\n*BS/BA or MS in Computer Science, Mathematics or related technical field\n*3+ years of experience with object-oriented programming languages (preferably Java)\n*3+ years of experience in data analytics\n*3+ years of experience with schema design and dimensional data modeling\n*3+ years of experience in writing efficient SQL statements\n*Proven experience building scalable data services and systems\n*Ability to analyze data to identify deliverables, gaps, and inconsistencies\n*Effective communication skills with the ability to identify and communicate data driven insights\n*Ability in managing and communicating data warehouse plans to internal clients\n*Prior experience with *nix systems.\n \nNice To Have Skills:\n\n*Prior experience with Python, Java, and/or Scala\n*Prior experience implementing Machine Learning services at scale in a production environment\n*Prior experience in telephony and communication industry\n*Experience working with Apache Spark or Hadoop\n*Knowledge of AWS-based solution delivery\n\nCompany Benefits:\n\nAt First Orion we offer a competitive salary, full benefit package including matching 401(k) and an open paid time off policy. Our work environment is energetic, focused, fun, and collaborative. We?ve created a special culture where trust and transparency are key and employees are empowered to make their own decisions. Our people are passionate about what we do and have an indomitable spirit to get things done. Everyone is a part of the big picture here.\n\nFirst Orion Voted Great Place to Work US with Top Rankings in every category! Check out the full spread here: http://ow.ly/a731303vHps.",
		"appLink": "https://grnh.se/d4cf62f81",
		"orgName": "First Orion",
		"orgDesc": "First Orion is an industry-leading call protection and data provider, developing software and services to enable our customers to take complete control over their telecommunications, powered by world-class data and technology solutions. Our applications and in-network services provide call and text blocking, spam and robocall blocking, caller identification, directory assistance and complaint filing with regulatory agencies in US and abroad. With our help, customers have blocked over 200 million numbers and continue to file over 300,000 complaints monthly against offending callers directly to federal agencies. First Orion provides solutions to some of the largest mobile service process in the world and features leading brands in the communication industry including PrivacyStar with offices in Washington, Arkansas and London, England.  ",
		"Your Name": "Allison Nicholas",
		"Your Email": "anicholas@firstorion.com",
		"Your Phone": "501.269.4119"
	},
	{
		"logo": "/img/sponsors/dassault-falcon-jet.gif",
		"datePosted": "8/15/2018",
		"posTitle": "Data Scientist",
		"located": "Little Rock , AR",
		"posType": "Full Time",
		"posDesc": "Work closely with the respective Manager/Supervisor and business users to solve problems and identify opportunities. This position is responsible for the development of machine learning algorithms, analysis, cleansing and pipelining of business data in accordance with IT standards and processes. Work in a team environment and continuously monitor performance and quality control plans to identify improvements.",
		"appLink": "http://dassaultfalconjet-littlerock.isg2.com/Menu.asp?sst=Custom&SearchText=&KeyType=all&CatID=0&LocationID=0&x=48&y=15&FtrPlaceholder=",
		"orgName": "Dassault Falcon Jet",
		"orgDesc": "At Dassault Falcon Jet we are committed to finding the best and brightest professionals to help maintain our well-earned reputation for excellence.  Our employees represent the most dedicated individuals in the aviation industry and are truly our most valuable assets and the key to our success. There is a unifying pride in being recognized as a member of the Dassault family.  We share values, ideas and team spirit! It is our sincere wish that employment with us enables you to achieve the highest possible degree of personal fulfillment. If this describes the work environment you are seeking we encourage you to explore the possibilities of a career with our company. ",
		"Your Name": "Brent Burgin",
		"Your Email": "brent.burgin@falconjet.com",
		"Your Phone": "5013012237"
	},
	{
		"logo": "/img/sponsors/dassault-falcon-jet.gif",
		"datePosted": "8/15/2018",
		"posTitle": "Data Engineer",
		"located": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "Work closely with the respective Manager/Supervisor and business users to solve problems and identify opportunities. This position is responsible for the development of system interfaces, database objects and implementation of MDM programs in accordance with IT standards and processes. Work in a team environment and continuously monitor performance and quality control plans to identify improvements.",
		"appLink": "http://dassaultfalconjet-littlerock.isg2.com/menu.asp?ClientID=1825&B_ID=56&SearchText=&LocationID=0&PositionID=&CatID=0&Open=on&KeyType=all&SelectAll.x=&OrderBy=&StartAt=0",
		"orgName": "Dassault Falcon Jet",
		"orgDesc": "At Dassault Falcon Jet we are committed to finding the best and brightest professionals to help maintain our well-earned reputation for excellence.  Our employees represent the most dedicated individuals in the aviation industry and are truly our most valuable assets and the key to our success. There is a unifying pride in being recognized as a member of the Dassault family.  We share values, ideas and team spirit! It is our sincere wish that employment with us enables you to achieve the highest possible degree of personal fulfillment. If this describes the work environment you are seeking we encourage you to explore the possibilities of a career with our company. ",
		"Your Name": "Brent Burgin",
		"Your Email": "brent.burgin@falconjet.com",
		"Your Phone": "5013012237"
	},
	{
		"logo": "/img/sponsors/supply-pike.png",
		"datePosted": "9/8/18",
		"posTitle": "Software Engineer",
		"located": "Fayetteville, AR",
		"posType": "Full Time",
		"posDesc": "<b>Primary Responsibilities</b>\n\n Collaborate with product management, UX designers, and stakeholders to design and engineer products.\n\n Work on the frontend and backend code to develop new features from start to finish, which includes system design, developing, testing, deploying, and monitoring of the features.\n\n Build high-quality software while paying particular attention to design patterns, maintainability, scalability, and performance.",
		"appLink": "https://hire.withgoogle.com/public/jobs/supplypike/view/P_AAAAAADAAADNK5zjjhK7Da",
		"orgName": "SupplyPike",
		"orgDesc": "At SupplyPike we strive to create an environment where people walk in excited: to work together and to build the future of supply chain. We are a creative and data-driven team that enjoys turning problems into solutions. We've been told we're pretty fun to work with! Join Us!",
		"Your Name": "Shannon Harris",
		"Your Email": "shannon@supplypike.com",
		"Your Phone": "4798418345"
	},
	{
		"logo": "/img/sponsors/supply-pike.png",
		"datePosted": "9/8/18",
		"posTitle": "UX/Product Designer",
		"located": "Fayetteville, AR",
		"posType": "Full Time",
		"posDesc": "We are looking to hire experienced designers to join our ever-expanding team.  An ideal candidate would be a self-motivated and creative problem solver who enjoys hashing out solutions with co-workers. As a UX Designer you will have command over end-to-end product experiences, and be offered the opportunity to participate in all stages of our development process from conception through release, including:\n\n *Gathering requirements and modeling complex business processes\n *Working directly with product management, engineering, and stakeholders to define, design, validate and deliver products that are highly desirable, beautiful, and usable\n *Developing conceptual models, user flows and personas\n *Creating low and high fidelity design prototypes \n*Prototyping interactions to test and demonstrate concepts\n*Conducting usability, A/B testing and research\n*Collaborating with development teams to guide and support implementation of final designs\n*Providing usability recommendations based on industry best practices, analytics, and user behavior",
		"appLink": "https://hire.withgoogle.com/public/jobs/supplypike/view/P_AAAAAADAAADMkenhC4sQL7",
		"orgName": "SupplyPike",
		"orgDesc": "Supply chain is not an industry synonymous with innovation. SupplyPike is here to change that. We believe the power to respond to the evolving retail landscape exists in a seamlessly collaborative supply chain where retailers, suppliers and everyone in between can work together. SupplyPike uses technologies like machine learning and artificial intelligence to inform and build products that are simple, effective and usable by everyone, no matter their level of supply chain experience.",
		"Your Name": "Shannon Harris",
		"Your Email": "shannon@supplypike.com",
		"Your Phone": "4798418345"
	},
	{
		"logo": "/img/sponsors/abc-financial.png",
		"datePosted": "9/10/18",
		"posTitle": "VP of Product Management ",
		"located": "Sherwood, AR",
		"posType": "Full Time",
		"posDesc": "The VP of Product Management is responsible for guiding the company's strategic product roadmap definition, implementation, and go-to-market execution. Through engagement and collaboration with customers, internal stakeholders, and leveraging a deep knowledge of market and technology trends, this VP of Product Management is the executive leader who is accountable for all product P&Ls.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES\n-Understand innovation and business model changes occurring in the fitness industry and beyond, with a particular emphasis on technology and anticipating product feature needs\n-Anticipate customer and internal stakeholder product feature needs and define marketable products and effective strategic roadmaps to achieve profitable outcomes.\n-Partners closely with business unit leaders and senior leadership throughout the organization to achieve key financial growth and productivity targets.\n-Define product profitability and operational model expectations including creating defined go-to-market strategies, messaging, and proforma P&L targets.\n-Develop a team of product managers capable of executing the company's vision and business needs as translated into a product roadmap.\n-Work with the sales team to optimize the sale of the product to keep current with market and industry needs, forecast and address competition\n-Continuously improve the profitability of the product lines\n-Organize and align company priorities around the product roadmap\n-Develop customer feedback systems to ascertain additional customer needs and overall product satisfaction\n-Work across all functions of the business to ensure successful product delivery (ideation, development, marketing, sales, operations/support, and client management).\n-Define specific and focused messaging around products to ensure external and internal clarity of product positioning, features, benefits, and target markets.",
		"appLink": "https://www.appone.com/MainInfoReq.asp?R_ID=2017946",
		"orgName": "ABC Financial Services, LLC",
		"orgDesc": "ABC Financial is the nation's leading software and payment processing provider for health and fitness clubs. Its comprehensive offerings include payment processing solutions and advanced health club management tools, such as DataTrak, that allow gym owners and managers to track and manage memberships and member and employee schedules, drive member engagement, and automate payment processing functions. Founded in 1981 by Jim Bottin, ABC Financial's cutting edge technology and top quality customer service are utilized by more than 7,000 health clubs across the United States, Canada, Mexico and Puerto Rico. The company's software has won numerous design and feature awards, such as Club Industry's Best of the Best and IHRSA's Vendor of the Year. In January 2018, ABC Financial was acquired by an affiliate of Thoma Bravo, LLC, a private equity firm based in San Francisco, CA and Chicago, IL (thomabravo.com).\n\n ABC Financial is a sought after destination for employment as the environment is conducive to continued professional growth and development with extremely passionate team members. With a team of crazy, fun, and committeed associates.    Mission: Our company mission is two-fold: to be the resource for cutting-edge technology in the health and fitness industry and to maximize collections from the highest percentage of members on a daily basis. Our driving force is the obsession with creating \"Raving Fans\".",
		"Your Name": "Tyler Baumgardner",
		"Your Email": "tyler.baumgardner@abcfinancial.com",
		"Your Phone": "501-515-5000 ext. 1589"
	},
	{
		"logo": "/img/sponsors/abc-financial.png",
		"datePosted": "9/10/18",
		"posTitle": "QA Automation Engineer",
		"located": "Sherwood, AR",
		"posType": "Full Time",
		"posDesc": "The QA Automation Engineer (QAE) is a test engineer who plays a critical role in the agile development team and is primarily responsible for designing, developing, and implementing test frameworks, test validation scripts, and test data strategies within an integrated DevOps infrastructure covering the full product stack.\n\nThis position will also be responsible for coordinating quality assurance testing activities including understanding business requirements, features, and technical implementation along with drafting test documentation, executing test scripts, tracking defects, and monitoring testing activity. The QAE will serve as a subject matter expert on the development of testing approaches and methodologies. The QAE work is critical in driving the testing efficiencies necessary for successful agile product development.",
		"appLink": "https://www.appone.com/MainInfoReq.asp?R_ID=1770331",
		"orgName": "ABC Financial Services, LLC",
		"orgDesc": "ABC Financial is the nation's leading software and payment processing provider for health and fitness clubs. Its comprehensive offerings include payment processing solutions and advanced health club management tools, such as DataTrak, that allow gym owners and managers to track and manage memberships and member and employee schedules, drive member engagement, and automate payment processing functions. Founded in 1981 by Jim Bottin, ABC Financial's cutting edge technology and top quality customer service are utilized by more than 7,000 health clubs across the United States, Canada, Mexico and Puerto Rico. The company's software has won numerous design and feature awards, such as Club Industry's Best of the Best and IHRSA's Vendor of the Year. In January 2018, ABC Financial was acquired by an affiliate of Thoma Bravo, LLC, a private equity firm based in San Francisco, CA and Chicago, IL (thomabravo.com).\n\n ABC Financial is a sought after destination for employment as the environment is conducive to continued professional growth and development with extremely passionate team members. With a team of crazy, fun, and committeed associates.    Mission: Our company mission is two-fold: to be the resource for cutting-edge technology in the health and fitness industry and to maximize collections from the highest percentage of members on a daily basis. Our driving force is the obsession with creating \"Raving Fans\".",
		"Your Name": "Tyler Baumgardner",
		"Your Email": "tyler.baumgardner@abcfinancial.com",
		"Your Phone": "501-515-5000 ext. 1589"
	},
	{
		"logo": "/img/sponsors/first-orion.png",
		"datePosted": "10/11/18",
		"posTitle": "Linux Administrator",
		"located": "Little Rock, AR",
		"posType": "Full Time",
		"posDesc": "First Orion is an industry-leading call protection/transparency and data provider, developing software and services to enable our customers to take complete control over their telecommunications, powered by world-class data and technology solutions. Our applications and in-network services provide call and text blocking, spam and robocall tagging/blocking, caller identification, caller categorization, directory assistance and complaint filing with regulatory agencies in US and abroad. With our customers help we have tagged and/or blocked over 2.5 billion calls in the past 12 months and our users file over 50,000 complaints monthly against offending callers directly to federal agencies. First Orion provides solutions to some of the largest mobile service providers in the world and features leading brands in the communication industry including PrivacyStar with offices in Washington, Arkansas and London, England. \n\n We are looking for a Linux Administrator who will be responsible for designing, implementing, and monitoring the infrastructure; also, to collaborate with other team members to develop automation strategies and deployment processes.  Additional job responsibilities include: \n-Helping to tune performance and ensure high availability of infrastructure\n-Designing and developing infrastructure monitoring and reporting tools\n-Developing and maintaining configuration management solutions\n -On Call Rotation for issues\n-Afterhours Maintenance windows for Deployment of Application updates and configuration changes\n -Creating tools to help teams make the most out of the available infrastructure\n\nRequired Skills:\n-Experience with Linux servers in virtualized environments\n-Familiarity with the fundamentals of Linux scripting languages\n-A solid understanding of the Linux boot process and problem diagnosis\n-Experience installing, configuring, and maintaining services such as Apache, MySQL, Nginx and SNMP\n-Proficient with network tools such as Iptables, Linux IPVS and HAProxy\n-Ability to build and monitor services on production servers\n\nNice To Have Skills:\n-5+ years of industry experience focused on Linux including both software \n development and system administration\n-Bachelor of Science in Computer Science or related area of study\n-Telecommunications experience\n-Familiarity with load balancing and firewalls\n-Strong grasp on configuration management tools, such as Puppet and Chef \n-Experience maintaining open source packages and/or working with the open source community\n-Experience maintaining large scale Linux implementations\n-Proficient with Python and familiar with C, C++ and Java",
		"appLink": "https://grnh.se/fca877f41",
		"orgName": "First Orion",
		"orgDesc": "At First Orion we offer a competitive salary, full benefit package including matching 401(k) and an open paid time off policy. Our work environment is energetic, focused, fun, and collaborative. Weve created a special culture where trust and transparency are key and employees are empowered to make their own decisions. Our people are passionate about what we do and have an indomitable spirit to get things done. Everyone is a part of the big picture here.\n\nFirst Orion Voted Great Place to Work US with Top Rankings in every category! Check out the full spread here: http://ow.ly/a731303vHps.\n\nFirst Orion is an Affirmative Action and Equal Opportunity Employer. Apply today!",
		"Your Name": "Allison Nicholas",
		"Your Email": "anicholas@privacystar.com",
		"Your Phone": "501.269.4119"
	}
]